[{"start":229.11,"text":"Okay. Yes. Okay. I guess we can start"},{"start":229.12,"text":"Okay. Yes. Okay. I guess we can start now. Um, so this secure code to access"},{"start":233.35,"text":"now. Um, so this secure code to access"},{"start":233.36,"text":"now. Um, so this secure code to access this document which is the document that"},{"start":235.99,"text":"this document which is the document that"},{"start":236.0,"text":"this document which is the document that you usually use for the uh dual HP PC"},{"start":239.19,"text":"you usually use for the uh dual HP PC"},{"start":239.2,"text":"you usually use for the uh dual HP PC monthly meetings."},{"start":241.429,"text":"monthly meetings."},{"start":241.439,"text":"monthly meetings. Uh so the idea of this Oh, yay. The idea"},{"start":244.789,"text":"Uh so the idea of this Oh, yay. The idea"},{"start":244.799,"text":"Uh so the idea of this Oh, yay. The idea of this um both was to run one of our"},{"start":248.63,"text":"of this um both was to run one of our"},{"start":248.64,"text":"of this um both was to run one of our usual uh monthly meetings but here in"},{"start":250.55,"text":"usual uh monthly meetings but here in"},{"start":250.56,"text":"usual uh monthly meetings but here in person instead of online but um this is"},{"start":253.91,"text":"person instead of online but um this is"},{"start":253.92,"text":"person instead of online but um this is also an occasion to remind you that we"},{"start":256.229,"text":"also an occasion to remind you that we"},{"start":256.239,"text":"also an occasion to remind you that we run every month actually two um uh calls"},{"start":260.15,"text":"run every month actually two um uh calls"},{"start":260.16,"text":"run every month actually two um uh calls one more European friendly time and the"},{"start":263.27,"text":"one more European friendly time and the"},{"start":263.28,"text":"one more European friendly time and the other uh more US friendly time. You find"},{"start":265.83,"text":"other uh more US friendly time. You find"},{"start":265.84,"text":"other uh more US friendly time. You find all this information on the Julink"},{"start":267.59,"text":"all this information on the Julink"},{"start":267.6,"text":"all this information on the Julink website if you go to julink.org. /"},{"start":270.71,"text":"website if you go to julink.org. /"},{"start":270.72,"text":"website if you go to julink.org. / community there is a calendar of event"},{"start":272.629,"text":"community there is a calendar of event"},{"start":272.639,"text":"community there is a calendar of event and yeah I think it's the second"},{"start":275.83,"text":"and yeah I think it's the second"},{"start":275.84,"text":"and yeah I think it's the second Thursday of the week is the European"},{"start":277.83,"text":"Thursday of the week is the European"},{"start":277.84,"text":"Thursday of the week is the European time and the fourth Tuesday of the month"},{"start":281.35,"text":"time and the fourth Tuesday of the month"},{"start":281.36,"text":"time and the fourth Tuesday of the month sorry and the fourth uh Tuesday of the"},{"start":283.909,"text":"sorry and the fourth uh Tuesday of the"},{"start":283.919,"text":"sorry and the fourth uh Tuesday of the month is the US uh friendly time. So if"},{"start":287.27,"text":"month is the US uh friendly time. So if"},{"start":287.28,"text":"month is the US uh friendly time. So if you're interested in using Julon HPC"},{"start":289.59,"text":"you're interested in using Julon HPC"},{"start":289.6,"text":"you're interested in using Julon HPC please uh come to this um calls and we"},{"start":292.629,"text":"please uh come to this um calls and we"},{"start":292.639,"text":"please uh come to this um calls and we can chat about stuff."},{"start":295.189,"text":"can chat about stuff."},{"start":295.199,"text":"can chat about stuff. So if you go to this"},{"start":298.629,"text":"So if you go to this"},{"start":298.639,"text":"So if you go to this to to this document uh you can add here"},{"start":301.35,"text":"to to this document uh you can add here"},{"start":301.36,"text":"to to this document uh you can add here the uh topics that you want to discuss"},{"start":303.43,"text":"the uh topics that you want to discuss"},{"start":303.44,"text":"the uh topics that you want to discuss about this is open uh like you can"},{"start":305.83,"text":"about this is open uh like you can"},{"start":305.84,"text":"about this is open uh like you can suggest anything you want to talk about"},{"start":307.59,"text":"suggest anything you want to talk about"},{"start":307.6,"text":"suggest anything you want to talk about like questions problems that you"},{"start":309.909,"text":"like questions problems that you"},{"start":309.919,"text":"like questions problems that you encountered things that you would like"},{"start":312.31,"text":"encountered things that you would like"},{"start":312.32,"text":"encountered things that you would like to to improve success stories if you"},{"start":316.07,"text":"to to improve success stories if you"},{"start":316.08,"text":"to to improve success stories if you have success stories to share or yeah"},{"start":318.95,"text":"have success stories to share or yeah"},{"start":318.96,"text":"have success stories to share or yeah anything like this um do you have"},{"start":321.51,"text":"anything like this um do you have"},{"start":321.52,"text":"anything like this um do you have anything to add Johannes"},{"start":323.59,"text":"anything to add Johannes"},{"start":323.6,"text":"anything to add Johannes &gt;&gt; he's Johannes Yeah, maybe little bit"},{"start":325.909,"text":"&gt;&gt; he's Johannes Yeah, maybe little bit"},{"start":325.919,"text":"&gt;&gt; he's Johannes Yeah, maybe little bit introduction."},{"start":326.31,"text":"introduction."},{"start":326.32,"text":"introduction. &gt;&gt; Johannes."},{"start":343.749,"text":"&gt;&gt; Hi, I'm Johannes. I work at a large"},{"start":343.759,"text":"&gt;&gt; Hi, I'm Johannes. I work at a large supercomputing center for the US"},{"start":345.189,"text":"supercomputing center for the US"},{"start":345.199,"text":"supercomputing center for the US Department of Energy. And um I think the"},{"start":348.39,"text":"Department of Energy. And um I think the"},{"start":348.4,"text":"Department of Energy. And um I think the cool thing that NURK does is we do the"},{"start":350.629,"text":"cool thing that NURK does is we do the"},{"start":350.639,"text":"cool thing that NURK does is we do the open research part. And also uh we are"},{"start":354.39,"text":"open research part. And also uh we are"},{"start":354.4,"text":"open research part. And also uh we are not allowed to choose our users which is"},{"start":357.27,"text":"not allowed to choose our users which is"},{"start":357.28,"text":"not allowed to choose our users which is a fun challenge. Um so yeah and and I'm"},{"start":362.07,"text":"a fun challenge. Um so yeah and and I'm"},{"start":362.08,"text":"a fun challenge. Um so yeah and and I'm involved in Julia because I think it"},{"start":363.67,"text":"involved in Julia because I think it"},{"start":363.68,"text":"involved in Julia because I think it solves a lot of the HPC problems"},{"start":365.27,"text":"solves a lot of the HPC problems"},{"start":365.28,"text":"solves a lot of the HPC problems properly."},{"start":368.07,"text":"properly."},{"start":368.08,"text":"properly. Yeah I'm Jordan. I'm a"},{"start":371.189,"text":"Yeah I'm Jordan. I'm a"},{"start":371.199,"text":"Yeah I'm Jordan. I'm a research software engineer at um UCL."},{"start":374.79,"text":"research software engineer at um UCL."},{"start":374.8,"text":"research software engineer at um UCL. Um yeah, my my interest in is in Julia"},{"start":377.43,"text":"Um yeah, my my interest in is in Julia"},{"start":377.44,"text":"Um yeah, my my interest in is in Julia and HPC in particular and I try to help"},{"start":380.469,"text":"and HPC in particular and I try to help"},{"start":380.479,"text":"and HPC in particular and I try to help this community going and yeah"},{"start":384.309,"text":"this community going and yeah"},{"start":384.319,"text":"this community going and yeah so yeah start filling this."},{"start":393.83,"text":"&gt;&gt; Yes. Yeah. Yeah, if there are questions"},{"start":393.84,"text":"&gt;&gt; Yes. Yeah. Yeah, if there are questions that you don't want to write down, but"},{"start":424.39,"text":"&gt;&gt; like why you came here like you already"},{"start":424.4,"text":"&gt;&gt; like why you came here like you already look raise your hands if you are already"},{"start":426.309,"text":"look raise your hands if you are already"},{"start":426.319,"text":"look raise your hands if you are already using Julia on HPC"},{"start":429.029,"text":"using Julia on HPC"},{"start":429.039,"text":"using Julia on HPC okay"},{"start":434.55,"text":"&gt;&gt; there's people who are interested but"},{"start":434.56,"text":"&gt;&gt; there's people who are interested but don't use it on HPC"},{"start":437.99,"text":"don't use it on HPC"},{"start":438.0,"text":"don't use it on HPC &gt;&gt; okay can I pick on you"},{"start":441.27,"text":"&gt;&gt; okay can I pick on you"},{"start":441.28,"text":"&gt;&gt; okay can I pick on you can can you maybe"},{"start":443.67,"text":"can can you maybe"},{"start":443.68,"text":"can can you maybe tell us whatever you want to tell us"},{"start":446.71,"text":"tell us whatever you want to tell us"},{"start":446.72,"text":"tell us whatever you want to tell us about why you are interested in HPC"},{"start":451.27,"text":"about why you are interested in HPC"},{"start":451.28,"text":"about why you are interested in HPC okay so my background is in high energy."},{"start":453.27,"text":"okay so my background is in high energy."},{"start":453.28,"text":"okay so my background is in high energy. So I'm Graeme from CERN right now will"},{"start":455.83,"text":"So I'm Graeme from CERN right now will"},{"start":455.84,"text":"So I'm Graeme from CERN right now will be moving to Daisy um this summer. I"},{"start":459.35,"text":"be moving to Daisy um this summer. I"},{"start":459.36,"text":"be moving to Daisy um this summer. I which are both two big particle physics"},{"start":461.189,"text":"which are both two big particle physics"},{"start":461.199,"text":"which are both two big particle physics labs. Um I'm here because"},{"start":465.11,"text":"labs. Um I'm here because"},{"start":465.12,"text":"labs. Um I'm here because uh I'll give two reasons. One is because"},{"start":468.79,"text":"uh I'll give two reasons. One is because"},{"start":468.8,"text":"uh I'll give two reasons. One is because um in particle physics there are"},{"start":471.909,"text":"um in particle physics there are"},{"start":471.919,"text":"um in particle physics there are strategic changes which are requiring us"},{"start":474.79,"text":"strategic changes which are requiring us"},{"start":474.8,"text":"strategic changes which are requiring us to move from largecale grid distributed"},{"start":478.469,"text":"to move from largecale grid distributed"},{"start":478.479,"text":"to move from largecale grid distributed computing systems which are not going"},{"start":480.15,"text":"computing systems which are not going"},{"start":480.16,"text":"computing systems which are not going away but to use HPCs more and more and"},{"start":484.39,"text":"away but to use HPCs more and more and"},{"start":484.4,"text":"away but to use HPCs more and more and as a community we have to think about"},{"start":486.71,"text":"as a community we have to think about"},{"start":486.72,"text":"as a community we have to think about how we can most effectively do that. Um,"},{"start":490.39,"text":"how we can most effectively do that. Um,"},{"start":490.4,"text":"how we can most effectively do that. Um, so I'm interested in Julia on HBC as a"},{"start":493.189,"text":"so I'm interested in Julia on HBC as a"},{"start":493.199,"text":"so I'm interested in Julia on HBC as a general topic, even though Julia is my"},{"start":495.67,"text":"general topic, even though Julia is my"},{"start":495.68,"text":"general topic, even though Julia is my hobby horse, not the mainline"},{"start":497.83,"text":"hobby horse, not the mainline"},{"start":497.84,"text":"hobby horse, not the mainline development of the community. Um, and"},{"start":500.469,"text":"development of the community. Um, and"},{"start":500.479,"text":"development of the community. Um, and secondly, I'm interested in HBC's for"},{"start":503.43,"text":"secondly, I'm interested in HBC's for"},{"start":503.44,"text":"secondly, I'm interested in HBC's for light sources because part of my new"},{"start":505.189,"text":"light sources because part of my new"},{"start":505.199,"text":"light sources because part of my new role at Daisy will be doing uh a lot of"},{"start":508.629,"text":"role at Daisy will be doing uh a lot of"},{"start":508.639,"text":"role at Daisy will be doing uh a lot of work for the light source community. So"},{"start":510.71,"text":"work for the light source community. So"},{"start":510.72,"text":"work for the light source community. So I'm interested in experiences that"},{"start":513.11,"text":"I'm interested in experiences that"},{"start":513.12,"text":"I'm interested in experiences that people might have of using HPC's to"},{"start":516.23,"text":"people might have of using HPC's to"},{"start":516.24,"text":"people might have of using HPC's to support photon science as well. So yes,"},{"start":519.509,"text":"support photon science as well. So yes,"},{"start":519.519,"text":"support photon science as well. So yes, I'm here because I'm interested and"},{"start":522.55,"text":"I'm here because I'm interested and"},{"start":522.56,"text":"I'm here because I'm interested and happy to contribute any experiences that"},{"start":525.03,"text":"happy to contribute any experiences that"},{"start":525.04,"text":"happy to contribute any experiences that we have from high energy physics."},{"start":533.829,"text":"&gt;&gt; Brilliant. Thank you. Um"},{"start":533.839,"text":"&gt;&gt; Brilliant. Thank you. Um any anyone else want to share their HPC"},{"start":539.91,"text":"any anyone else want to share their HPC"},{"start":539.92,"text":"any anyone else want to share their HPC vibes?"},{"start":542.07,"text":"vibes?"},{"start":542.08,"text":"vibes? Are you worried about HPC? Are you new"},{"start":545.03,"text":"Are you worried about HPC? Are you new"},{"start":545.04,"text":"Are you worried about HPC? Are you new to HPC? You think, okay, I can quote one"},{"start":548.71,"text":"to HPC? You think, okay, I can quote one"},{"start":548.72,"text":"to HPC? You think, okay, I can quote one email I got two years ago saying, if"},{"start":551.829,"text":"email I got two years ago saying, if"},{"start":551.839,"text":"email I got two years ago saying, if only you invested all this energy, you'd"},{"start":554.07,"text":"only you invested all this energy, you'd"},{"start":554.08,"text":"only you invested all this energy, you'd invest in Jul you're investing in Julia"},{"start":556.07,"text":"invest in Jul you're investing in Julia"},{"start":556.08,"text":"invest in Jul you're investing in Julia in FORRAN, then I wouldn't have to learn"},{"start":559.11,"text":"in FORRAN, then I wouldn't have to learn"},{"start":559.12,"text":"in FORRAN, then I wouldn't have to learn C++,"},{"start":560.949,"text":"C++,"},{"start":560.959,"text":"C++, which which I thought was a hilarious"},{"start":563.59,"text":"which which I thought was a hilarious"},{"start":563.6,"text":"which which I thought was a hilarious thing to say. I asked them, why don't"},{"start":566.23,"text":"thing to say. I asked them, why don't"},{"start":566.24,"text":"thing to say. I asked them, why don't you use Julia?"},{"start":568.15,"text":"you use Julia?"},{"start":568.16,"text":"you use Julia? and they said um no like the vendor they"},{"start":572.07,"text":"and they said um no like the vendor they"},{"start":572.08,"text":"and they said um no like the vendor they feel like from the vendor side that they"},{"start":573.99,"text":"feel like from the vendor side that they"},{"start":574.0,"text":"feel like from the vendor side that they have to use C++ or forran which was a"},{"start":577.91,"text":"have to use C++ or forran which was a"},{"start":577.92,"text":"have to use C++ or forran which was a really weird uh so anyway that's an"},{"start":580.07,"text":"really weird uh so anyway that's an"},{"start":580.08,"text":"really weird uh so anyway that's an example of a perspective and I wanted to"},{"start":582.63,"text":"example of a perspective and I wanted to"},{"start":582.64,"text":"example of a perspective and I wanted to just like see that"},{"start":585.19,"text":"just like see that"},{"start":585.2,"text":"just like see that uh"},{"start":586.71,"text":"uh"},{"start":586.72,"text":"uh okay so um if you scroll up to the uh"},{"start":594.07,"text":"the top"},{"start":594.08,"text":"the top &gt;&gt; yes so so so I like until people maybe"},{"start":598.79,"text":"&gt;&gt; yes so so so I like until people maybe"},{"start":598.8,"text":"&gt;&gt; yes so so so I like until people maybe volunteer topics. I like to maybe bring"},{"start":602.23,"text":"volunteer topics. I like to maybe bring"},{"start":602.24,"text":"volunteer topics. I like to maybe bring this up. These are sort of evergreen"},{"start":604.949,"text":"this up. These are sort of evergreen"},{"start":604.959,"text":"this up. These are sort of evergreen issues. I think uh"},{"start":609.43,"text":"issues. I think uh"},{"start":609.44,"text":"issues. I think uh I think I was angry when I made that"},{"start":611.35,"text":"I think I was angry when I made that"},{"start":611.36,"text":"I think I was angry when I made that comment. What is this is more about like"},{"start":614.15,"text":"comment. What is this is more about like"},{"start":614.16,"text":"comment. What is this is more about like like Huh. Um so uh I guess nobody All"},{"start":618.87,"text":"like Huh. Um so uh I guess nobody All"},{"start":618.88,"text":"like Huh. Um so uh I guess nobody All right. So if is there anything in there"},{"start":621.11,"text":"right. So if is there anything in there"},{"start":621.12,"text":"right. So if is there anything in there that actually uh tickles people's fancy?"},{"start":630.87,"text":"Um, I'm interested in that very first"},{"start":630.88,"text":"Um, I'm interested in that very first topic about using Julia on a on a shared"},{"start":633.03,"text":"topic about using Julia on a on a shared"},{"start":633.04,"text":"topic about using Julia on a on a shared file system. Um, because one of the"},{"start":635.509,"text":"file system. Um, because one of the"},{"start":635.519,"text":"file system. Um, because one of the issues I have with using Julia on my"},{"start":637.91,"text":"issues I have with using Julia on my"},{"start":637.92,"text":"issues I have with using Julia on my cluster is that um, just starting it up"},{"start":641.75,"text":"cluster is that um, just starting it up"},{"start":641.76,"text":"cluster is that um, just starting it up often takes a long time. Like loading"},{"start":643.91,"text":"often takes a long time. Like loading"},{"start":643.92,"text":"often takes a long time. Like loading packages takes ages. And it's it's very"},{"start":646.79,"text":"packages takes ages. And it's it's very"},{"start":646.8,"text":"packages takes ages. And it's it's very noticeably not noticeably slower than"},{"start":649.43,"text":"noticeably not noticeably slower than"},{"start":649.44,"text":"noticeably not noticeably slower than loading it on my laptop, for example."},{"start":651.91,"text":"loading it on my laptop, for example."},{"start":651.92,"text":"loading it on my laptop, for example. And I know that part of this is because"},{"start":654.87,"text":"And I know that part of this is because"},{"start":654.88,"text":"And I know that part of this is because of the design of network file systems."},{"start":657.35,"text":"of the design of network file systems."},{"start":657.36,"text":"of the design of network file systems. Like they're not great at dealing with"},{"start":658.949,"text":"Like they're not great at dealing with"},{"start":658.959,"text":"Like they're not great at dealing with with lots of small files. And I wonder"},{"start":661.59,"text":"with lots of small files. And I wonder"},{"start":661.6,"text":"with lots of small files. And I wonder if people have found ways around that."},{"start":664.79,"text":"if people have found ways around that."},{"start":664.8,"text":"if people have found ways around that. Um I I have some colleagues who've"},{"start":667.35,"text":"Um I I have some colleagues who've"},{"start":667.36,"text":"Um I I have some colleagues who've experiment with experimented with using"},{"start":670.55,"text":"experiment with experimented with using"},{"start":670.56,"text":"experiment with experimented with using Docker containers for example, but this"},{"start":672.47,"text":"Docker containers for example, but this"},{"start":672.48,"text":"Docker containers for example, but this is with Python. Have people done things"},{"start":674.87,"text":"is with Python. Have people done things"},{"start":674.88,"text":"is with Python. Have people done things like that with Julia as well?"},{"start":692.63,"text":"I I'll chip in some experience. Um so"},{"start":692.64,"text":"I I'll chip in some experience. Um so yeah, I I think this is a a real issue."},{"start":695.59,"text":"yeah, I I think this is a a real issue."},{"start":695.6,"text":"yeah, I I think this is a a real issue. So we"},{"start":697.35,"text":"So we"},{"start":697.36,"text":"So we um"},{"start":699.19,"text":"um"},{"start":699.2,"text":"um because of the way high energy physics"},{"start":701.269,"text":"because of the way high energy physics"},{"start":701.279,"text":"because of the way high energy physics works and it's kind of this worldwide"},{"start":702.79,"text":"works and it's kind of this worldwide"},{"start":702.8,"text":"works and it's kind of this worldwide collaboration, we actually require a"},{"start":704.87,"text":"collaboration, we actually require a"},{"start":704.88,"text":"collaboration, we actually require a globally distributed file system which"},{"start":708.069,"text":"globally distributed file system which"},{"start":708.079,"text":"globally distributed file system which is quite a hard problem. Yeah, but we"},{"start":710.55,"text":"is quite a hard problem. Yeah, but we"},{"start":710.56,"text":"is quite a hard problem. Yeah, but we have this actually this terribly good"},{"start":712.47,"text":"have this actually this terribly good"},{"start":712.48,"text":"have this actually this terribly good solution called CVMFS"},{"start":715.11,"text":"solution called CVMFS"},{"start":715.12,"text":"solution called CVMFS um which is this like strongly caching"},{"start":718.069,"text":"um which is this like strongly caching"},{"start":718.079,"text":"um which is this like strongly caching uh file system that's distributed from a"},{"start":720.15,"text":"uh file system that's distributed from a"},{"start":720.16,"text":"uh file system that's distributed from a central place and it goes through a"},{"start":721.67,"text":"central place and it goes through a"},{"start":721.68,"text":"central place and it goes through a series of HTTP caches"},{"start":724.63,"text":"series of HTTP caches"},{"start":724.64,"text":"series of HTTP caches um right down to the worker node level."},{"start":727.269,"text":"um right down to the worker node level."},{"start":727.279,"text":"um right down to the worker node level. What's nice about that is that it well"},{"start":730.15,"text":"What's nice about that is that it well"},{"start":730.16,"text":"What's nice about that is that it well it it um will actually cache things on"},{"start":733.11,"text":"it it um will actually cache things on"},{"start":733.12,"text":"it it um will actually cache things on the worker node as well. So yeah, you do"},{"start":737.19,"text":"the worker node as well. So yeah, you do"},{"start":737.2,"text":"the worker node as well. So yeah, you do pay you pay the highest startup cost for"},{"start":740.79,"text":"pay you pay the highest startup cost for"},{"start":740.8,"text":"pay you pay the highest startup cost for the first job that runs on the cluster,"},{"start":743.91,"text":"the first job that runs on the cluster,"},{"start":743.92,"text":"the first job that runs on the cluster, but then hopefully the files that you"},{"start":746.23,"text":"but then hopefully the files that you"},{"start":746.24,"text":"but then hopefully the files that you need have been cached a bit closer to"},{"start":748.55,"text":"need have been cached a bit closer to"},{"start":748.56,"text":"need have been cached a bit closer to where the cluster is. Um, and then"},{"start":751.67,"text":"where the cluster is. Um, and then"},{"start":751.68,"text":"where the cluster is. Um, and then subsequent startups on that cluster"},{"start":754.31,"text":"subsequent startups on that cluster"},{"start":754.32,"text":"subsequent startups on that cluster should be faster. And then when you have"},{"start":756.87,"text":"should be faster. And then when you have"},{"start":756.88,"text":"should be faster. And then when you have the second job that uses the same files"},{"start":759.35,"text":"the second job that uses the same files"},{"start":759.36,"text":"the second job that uses the same files on the same worker node, it will be able"},{"start":761.829,"text":"on the same worker node, it will be able"},{"start":761.839,"text":"on the same worker node, it will be able to get those files locally. So it"},{"start":763.59,"text":"to get those files locally. So it"},{"start":763.6,"text":"to get those files locally. So it becomes incredibly fast actually at that"},{"start":766.23,"text":"becomes incredibly fast actually at that"},{"start":766.24,"text":"becomes incredibly fast actually at that point. So that's something that we like"},{"start":768.47,"text":"point. So that's something that we like"},{"start":768.48,"text":"point. So that's something that we like quite a lot and we had a a summer"},{"start":771.03,"text":"quite a lot and we had a a summer"},{"start":771.04,"text":"quite a lot and we had a a summer student worked with me last year on"},{"start":773.91,"text":"student worked with me last year on"},{"start":773.92,"text":"student worked with me last year on writing pre-ompilation files from Julia"},{"start":776.949,"text":"writing pre-ompilation files from Julia"},{"start":776.959,"text":"writing pre-ompilation files from Julia into CVMFS and it does work and we were"},{"start":780.31,"text":"into CVMFS and it does work and we were"},{"start":780.32,"text":"into CVMFS and it does work and we were able to reduce the startup time of"},{"start":783.35,"text":"able to reduce the startup time of"},{"start":783.36,"text":"able to reduce the startup time of simulation jobs in high energy physics"},{"start":785.59,"text":"simulation jobs in high energy physics"},{"start":785.6,"text":"simulation jobs in high energy physics from 80 seconds to 2 seconds. So it"},{"start":789.35,"text":"from 80 seconds to 2 seconds. So it"},{"start":789.36,"text":"from 80 seconds to 2 seconds. So it worked really well and it scales very"},{"start":791.269,"text":"worked really well and it scales very"},{"start":791.279,"text":"worked really well and it scales very well. So that's not a piece of work that"},{"start":793.269,"text":"well. So that's not a piece of work that"},{"start":793.279,"text":"well. So that's not a piece of work that we've been able to advance much, but I"},{"start":796.069,"text":"we've been able to advance much, but I"},{"start":796.079,"text":"we've been able to advance much, but I don't know what the state is of CVMFS. I"},{"start":799.91,"text":"don't know what the state is of CVMFS. I"},{"start":799.92,"text":"don't know what the state is of CVMFS. I think it's very different on different"},{"start":801.269,"text":"think it's very different on different"},{"start":801.279,"text":"think it's very different on different HPC clusters whether you're allowed to"},{"start":803.829,"text":"HPC clusters whether you're allowed to"},{"start":803.839,"text":"HPC clusters whether you're allowed to use it. Uh the problem that we would"},{"start":806.23,"text":"use it. Uh the problem that we would"},{"start":806.24,"text":"use it. Uh the problem that we would have with Docker containers"},{"start":808.629,"text":"have with Docker containers"},{"start":808.639,"text":"have with Docker containers is that our software stack is humongous"},{"start":811.67,"text":"is that our software stack is humongous"},{"start":811.68,"text":"is that our software stack is humongous and so even the startup time for a"},{"start":813.59,"text":"and so even the startup time for a"},{"start":813.6,"text":"and so even the startup time for a Docker container on a local high"},{"start":815.99,"text":"Docker container on a local high"},{"start":816.0,"text":"Docker container on a local high performance file system is non-trivial"},{"start":818.55,"text":"performance file system is non-trivial"},{"start":818.56,"text":"performance file system is non-trivial actually. So that's just a bit of"},{"start":821.03,"text":"actually. So that's just a bit of"},{"start":821.04,"text":"actually. So that's just a bit of experience from our side. So that's"},{"start":823.19,"text":"experience from our side. So that's"},{"start":823.2,"text":"experience from our side. So that's certainly a solution I would be keen to"},{"start":827.67,"text":"certainly a solution I would be keen to"},{"start":827.68,"text":"certainly a solution I would be keen to help explore a bit more if it's useful"},{"start":829.67,"text":"help explore a bit more if it's useful"},{"start":829.68,"text":"help explore a bit more if it's useful for other people. The downside is it's"},{"start":832.71,"text":"for other people. The downside is it's"},{"start":832.72,"text":"for other people. The downside is it's absolutely"},{"start":834.47,"text":"absolutely"},{"start":834.48,"text":"absolutely read only by the time it gets into"},{"start":836.71,"text":"read only by the time it gets into"},{"start":836.72,"text":"read only by the time it gets into CVMFS. So you have to really know what"},{"start":839.75,"text":"CVMFS. So you have to really know what"},{"start":839.76,"text":"CVMFS. So you have to really know what you're going to run and you have to"},{"start":841.75,"text":"you're going to run and you have to"},{"start":841.76,"text":"you're going to run and you have to prepare your cache appropriately."},{"start":850.31,"text":"other perspectives."},{"start":850.32,"text":"other perspectives. &gt;&gt; Um maybe I can. So uh recently I used"},{"start":852.79,"text":"&gt;&gt; Um maybe I can. So uh recently I used"},{"start":852.8,"text":"&gt;&gt; Um maybe I can. So uh recently I used Julian Alps and I surprisingly didn't"},{"start":856.629,"text":"Julian Alps and I surprisingly didn't"},{"start":856.639,"text":"Julian Alps and I surprisingly didn't have any issues. I don't know what they"},{"start":858.389,"text":"have any issues. I don't know what they"},{"start":858.399,"text":"have any issues. I don't know what they do. Ludic is not here but I I don't know"},{"start":861.269,"text":"do. Ludic is not here but I I don't know"},{"start":861.279,"text":"do. Ludic is not here but I I don't know how but it was not a problem spawning"},{"start":863.829,"text":"how but it was not a problem spawning"},{"start":863.839,"text":"how but it was not a problem spawning like 2,000 Julia processes which again"},{"start":866.79,"text":"like 2,000 Julia processes which again"},{"start":866.8,"text":"like 2,000 Julia processes which again surprised me because I was expecting"},{"start":868.389,"text":"surprised me because I was expecting"},{"start":868.399,"text":"surprised me because I was expecting issues. Uh but I heard that uh other"},{"start":871.91,"text":"issues. Uh but I heard that uh other"},{"start":871.92,"text":"issues. Uh but I heard that uh other people having success which I think is"},{"start":873.509,"text":"people having success which I think is"},{"start":873.519,"text":"people having success which I think is similar to what you were saying uh using"},{"start":875.59,"text":"similar to what you were saying uh using"},{"start":875.6,"text":"similar to what you were saying uh using TMPFS like you package up your um in a"},{"start":880.87,"text":"TMPFS like you package up your um in a"},{"start":880.88,"text":"TMPFS like you package up your um in a um TMPFS system and"},{"start":885.43,"text":"um TMPFS system and"},{"start":885.44,"text":"um TMPFS system and now in 111 we have a proper reloc"},{"start":888.31,"text":"now in 111 we have a proper reloc"},{"start":888.32,"text":"now in 111 we have a proper reloc relocatable"},{"start":890.629,"text":"relocatable"},{"start":890.639,"text":"relocatable and that should just work and yeah I"},{"start":893.91,"text":"and that should just work and yeah I"},{"start":893.92,"text":"and that should just work and yeah I heard people having success with that"},{"start":895.67,"text":"heard people having success with that"},{"start":895.68,"text":"heard people having success with that and also this confirms what Grammy was I"},{"start":898.71,"text":"and also this confirms what Grammy was I"},{"start":898.72,"text":"and also this confirms what Grammy was I think"},{"start":900.23,"text":"think"},{"start":900.24,"text":"think I I would um I mean what Graeme"},{"start":905.75,"text":"I I would um I mean what Graeme"},{"start":905.76,"text":"I I would um I mean what Graeme um pointed out about the readonly"},{"start":909.35,"text":"um pointed out about the readonly"},{"start":909.36,"text":"um pointed out about the readonly um caches"},{"start":911.509,"text":"um caches"},{"start":911.519,"text":"um caches um that's um I think speaking to the"},{"start":913.67,"text":"um that's um I think speaking to the"},{"start":913.68,"text":"um that's um I think speaking to the more general um"},{"start":917.43,"text":"more general um"},{"start":917.44,"text":"more general um um"},{"start":919.03,"text":"um"},{"start":919.04,"text":"um so so when you start to peel back the"},{"start":922.87,"text":"so so when you start to peel back the"},{"start":922.88,"text":"so so when you start to peel back the layers of how file systems work, you"},{"start":925.91,"text":"layers of how file systems work, you"},{"start":925.92,"text":"layers of how file systems work, you realize that there are a lot of"},{"start":927.11,"text":"realize that there are a lot of"},{"start":927.12,"text":"realize that there are a lot of optimizations you can make and they"},{"start":929.91,"text":"optimizations you can make and they"},{"start":929.92,"text":"optimizations you can make and they require you to make all sorts of"},{"start":931.269,"text":"require you to make all sorts of"},{"start":931.279,"text":"require you to make all sorts of different tradeoffs. So the general"},{"start":933.189,"text":"different tradeoffs. So the general"},{"start":933.199,"text":"different tradeoffs. So the general answer I always give is uh many HPC"},{"start":936.31,"text":"answer I always give is uh many HPC"},{"start":936.32,"text":"answer I always give is uh many HPC system admins uh including the people"},{"start":938.55,"text":"system admins uh including the people"},{"start":938.56,"text":"system admins uh including the people who make slurm uh view the the workload"},{"start":942.23,"text":"who make slurm uh view the the workload"},{"start":942.24,"text":"who make slurm uh view the the workload running on the HPC resources as a one"},{"start":946.15,"text":"running on the HPC resources as a one"},{"start":946.16,"text":"running on the HPC resources as a one single statically linked executable. Um"},{"start":950.069,"text":"single statically linked executable. Um"},{"start":950.079,"text":"single statically linked executable. Um how many times I've had to tar up a"},{"start":953.67,"text":"how many times I've had to tar up a"},{"start":953.68,"text":"how many times I've had to tar up a Julia depot SB cast it and then untar"},{"start":956.47,"text":"Julia depot SB cast it and then untar"},{"start":956.48,"text":"Julia depot SB cast it and then untar it. uh uh is just shocking uh especially"},{"start":959.509,"text":"it. uh uh is just shocking uh especially"},{"start":959.519,"text":"it. uh uh is just shocking uh especially seeing that we're in the 21st century."},{"start":961.509,"text":"seeing that we're in the 21st century."},{"start":961.519,"text":"seeing that we're in the 21st century. Um and so um a lot of container runtimes"},{"start":966.31,"text":"Um and so um a lot of container runtimes"},{"start":966.32,"text":"Um and so um a lot of container runtimes uh yeah get around this problem by"},{"start":967.91,"text":"uh yeah get around this problem by"},{"start":967.92,"text":"uh yeah get around this problem by creating uh readonly file or not only"},{"start":970.069,"text":"creating uh readonly file or not only"},{"start":970.079,"text":"creating uh readonly file or not only container runs a lot of centers um and I"},{"start":972.87,"text":"container runs a lot of centers um and I"},{"start":972.88,"text":"container runs a lot of centers um and I think Alps does this um you have a file"},{"start":976.71,"text":"think Alps does this um you have a file"},{"start":976.72,"text":"think Alps does this um you have a file system that becomes read only on the"},{"start":978.15,"text":"system that becomes read only on the"},{"start":978.16,"text":"system that becomes read only on the computes once it's read only on the"},{"start":980.069,"text":"computes once it's read only on the"},{"start":980.079,"text":"computes once it's read only on the computes you don't have to worry about"},{"start":981.509,"text":"computes you don't have to worry about"},{"start":981.519,"text":"computes you don't have to worry about communicating uh changes to the file"},{"start":983.509,"text":"communicating uh changes to the file"},{"start":983.519,"text":"communicating uh changes to the file system"},{"start":984.629,"text":"system"},{"start":984.639,"text":"system &gt;&gt; uh so ahead of your job you just cache"},{"start":986.71,"text":"&gt;&gt; uh so ahead of your job you just cache"},{"start":986.72,"text":"&gt;&gt; uh so ahead of your job you just cache it on the compute um as long as we can"},{"start":990.31,"text":"it on the compute um as long as we can"},{"start":990.32,"text":"it on the compute um as long as we can uh create a good state of the practice"},{"start":992.87,"text":"uh create a good state of the practice"},{"start":992.88,"text":"uh create a good state of the practice to use patterns like that. Um and I"},{"start":995.99,"text":"to use patterns like that. Um and I"},{"start":996.0,"text":"to use patterns like that. Um and I think this is a big problem in HBC"},{"start":997.67,"text":"think this is a big problem in HBC"},{"start":997.68,"text":"think this is a big problem in HBC because every system is different and so"},{"start":999.43,"text":"because every system is different and so"},{"start":999.44,"text":"because every system is different and so how do we share this knowledge? How do"},{"start":1000.949,"text":"how do we share this knowledge? How do"},{"start":1000.959,"text":"how do we share this knowledge? How do we say oh in Alps there's this corner"},{"start":1003.03,"text":"we say oh in Alps there's this corner"},{"start":1003.04,"text":"we say oh in Alps there's this corner there and on a nurse gets like global"},{"start":1004.71,"text":"there and on a nurse gets like global"},{"start":1004.72,"text":"there and on a nurse gets like global common software there's like these"},{"start":1006.47,"text":"common software there's like these"},{"start":1006.48,"text":"common software there's like these different corners which actually perform"},{"start":1007.91,"text":"different corners which actually perform"},{"start":1007.92,"text":"different corners which actually perform really really well it's just that nobody"},{"start":1009.91,"text":"really really well it's just that nobody"},{"start":1009.92,"text":"really really well it's just that nobody tells you um that's I think a challenge"},{"start":1012.79,"text":"tells you um that's I think a challenge"},{"start":1012.8,"text":"tells you um that's I think a challenge still um I think we do have a website"},{"start":1018.069,"text":"still um I think we do have a website"},{"start":1018.079,"text":"still um I think we do have a website nobody contributes to it"},{"start":1020.71,"text":"nobody contributes to it"},{"start":1020.72,"text":"nobody contributes to it &gt;&gt; um so I'm I'm responsible also for not"},{"start":1023.829,"text":"&gt;&gt; um so I'm I'm responsible also for not"},{"start":1023.839,"text":"&gt;&gt; um so I'm I'm responsible also for not contributing to that website"},{"start":1026.87,"text":"contributing to that website"},{"start":1026.88,"text":"contributing to that website &gt;&gt; yeah so there is this Julithub"},{"start":1043.189,"text":"systems with Julia support but should be"},{"start":1043.199,"text":"systems with Julia support but should be there should be notes about"},{"start":1049.99,"text":"yes so for adins there is this section"},{"start":1050.0,"text":"yes so for adins there is this section about how to provide Julia to users and"},{"start":1053.27,"text":"about how to provide Julia to users and"},{"start":1053.28,"text":"about how to provide Julia to users and uh maybe there is something about also"},{"start":1055.669,"text":"uh maybe there is something about also"},{"start":1055.679,"text":"uh maybe there is something about also file system stuff or maybe can be added"},{"start":1059.99,"text":"file system stuff or maybe can be added"},{"start":1060.0,"text":"file system stuff or maybe can be added Yeah. So, so maybe my uh recommendation"},{"start":1062.47,"text":"Yeah. So, so maybe my uh recommendation"},{"start":1062.48,"text":"Yeah. So, so maybe my uh recommendation to the folks in the room and anyone else"},{"start":1064.789,"text":"to the folks in the room and anyone else"},{"start":1064.799,"text":"to the folks in the room and anyone else who's listening at any point in time is"},{"start":1066.549,"text":"who's listening at any point in time is"},{"start":1066.559,"text":"who's listening at any point in time is to reach out to us with um examples of"},{"start":1070.47,"text":"to reach out to us with um examples of"},{"start":1070.48,"text":"to reach out to us with um examples of things that work and don't. And and"},{"start":1073.11,"text":"things that work and don't. And and"},{"start":1073.12,"text":"things that work and don't. And and perhaps the problem is um we need to put"},{"start":1076.95,"text":"perhaps the problem is um we need to put"},{"start":1076.96,"text":"perhaps the problem is um we need to put an area there for like halfbaked"},{"start":1079.19,"text":"an area there for like halfbaked"},{"start":1079.2,"text":"an area there for like halfbaked thoughts that other people can build off"},{"start":1081.99,"text":"thoughts that other people can build off"},{"start":1082.0,"text":"thoughts that other people can build off because I get an inbox full of ideas and"},{"start":1084.39,"text":"because I get an inbox full of ideas and"},{"start":1084.4,"text":"because I get an inbox full of ideas and I'm like yeah if I only had 48 hours in"},{"start":1087.029,"text":"I'm like yeah if I only had 48 hours in"},{"start":1087.039,"text":"I'm like yeah if I only had 48 hours in the day then I could work on these. Um"},{"start":1089.51,"text":"the day then I could work on these. Um"},{"start":1089.52,"text":"the day then I could work on these. Um so uh if we could share that work of"},{"start":1091.909,"text":"so uh if we could share that work of"},{"start":1091.919,"text":"so uh if we could share that work of just spreading you know for example CVM"},{"start":1094.71,"text":"just spreading you know for example CVM"},{"start":1094.72,"text":"just spreading you know for example CVM I didn't had no idea that you could do"},{"start":1096.07,"text":"I didn't had no idea that you could do"},{"start":1096.08,"text":"I didn't had no idea that you could do pre-ompile CVMFS is that written down"},{"start":1098.23,"text":"pre-ompile CVMFS is that written down"},{"start":1098.24,"text":"pre-ompile CVMFS is that written down somewhere."},{"start":1100.71,"text":"somewhere."},{"start":1100.72,"text":"somewhere. Ah, perfect."},{"start":1102.31,"text":"Ah, perfect."},{"start":1102.32,"text":"Ah, perfect. &gt;&gt; Yeah. So, we could add that there,"},{"start":1103.909,"text":"&gt;&gt; Yeah. So, we could add that there,"},{"start":1103.919,"text":"&gt;&gt; Yeah. So, we could add that there, right?"},{"start":1104.95,"text":"right?"},{"start":1104.96,"text":"right? &gt;&gt; Um, yeah."},{"start":1106.549,"text":"&gt;&gt; Um, yeah."},{"start":1106.559,"text":"&gt;&gt; Um, yeah. &gt;&gt; So, there is something here about place"},{"start":1108.47,"text":"&gt;&gt; So, there is something here about place"},{"start":1108.48,"text":"&gt;&gt; So, there is something here about place Julis,"},{"start":1110.31,"text":"Julis,"},{"start":1110.32,"text":"Julis, &gt;&gt; right? Um, but but that Yeah. So,"},{"start":1113.19,"text":"&gt;&gt; right? Um, but but that Yeah. So,"},{"start":1113.2,"text":"&gt;&gt; right? Um, but but that Yeah. So, exactly. Here we go. We've got like the"},{"start":1114.71,"text":"exactly. Here we go. We've got like the"},{"start":1114.72,"text":"exactly. Here we go. We've got like the scratch example uh for"},{"start":1116.549,"text":"scratch example uh for"},{"start":1116.559,"text":"scratch example uh for &gt;&gt; Yeah. on apps. I was putting uh in"},{"start":1118.23,"text":"&gt;&gt; Yeah. on apps. I was putting uh in"},{"start":1118.24,"text":"&gt;&gt; Yeah. on apps. I was putting uh in scratch that I put"},{"start":1126.549,"text":"&gt;&gt; just like a little thing that maybe"},{"start":1126.559,"text":"&gt;&gt; just like a little thing that maybe people are already doing, but what I um"},{"start":1128.63,"text":"people are already doing, but what I um"},{"start":1128.64,"text":"people are already doing, but what I um did to make it a bit more smoother is to"},{"start":1131.35,"text":"did to make it a bit more smoother is to"},{"start":1131.36,"text":"did to make it a bit more smoother is to in my start script where I submit the"},{"start":1133.35,"text":"in my start script where I submit the"},{"start":1133.36,"text":"in my start script where I submit the job that I already make sure I run the"},{"start":1135.35,"text":"job that I already make sure I run the"},{"start":1135.36,"text":"job that I already make sure I run the pre-ompilation with the same depot on"},{"start":1137.83,"text":"pre-ompilation with the same depot on"},{"start":1137.84,"text":"pre-ompilation with the same depot on the login node and then um you don't hit"},{"start":1141.83,"text":"the login node and then um you don't hit"},{"start":1141.84,"text":"the login node and then um you don't hit too many pre-ompilations on the comput"},{"start":1144.31,"text":"too many pre-ompilations on the comput"},{"start":1144.32,"text":"too many pre-ompilations on the comput nodes because I I think there was some"},{"start":1146.71,"text":"nodes because I I think there was some"},{"start":1146.72,"text":"nodes because I I think there was some relatively recent work to make it better"},{"start":1148.47,"text":"relatively recent work to make it better"},{"start":1148.48,"text":"relatively recent work to make it better when multiple processor are trying to"},{"start":1150.95,"text":"when multiple processor are trying to"},{"start":1150.96,"text":"when multiple processor are trying to pre-ompile the same thing. But I I still"},{"start":1152.71,"text":"pre-ompile the same thing. But I I still"},{"start":1152.72,"text":"pre-ompile the same thing. But I I still found it's a bit easier if you have like"},{"start":1154.789,"text":"found it's a bit easier if you have like"},{"start":1154.799,"text":"found it's a bit easier if you have like one process doing most of the"},{"start":1156.87,"text":"one process doing most of the"},{"start":1156.88,"text":"one process doing most of the prempilation stuff"},{"start":1157.99,"text":"prempilation stuff"},{"start":1158.0,"text":"prempilation stuff &gt;&gt; and you also want"},{"start":1160.15,"text":"&gt;&gt; and you also want"},{"start":1160.16,"text":"&gt;&gt; and you also want &gt;&gt; Yeah."},{"start":1162.789,"text":"&gt;&gt; Yeah."},{"start":1162.799,"text":"&gt;&gt; Yeah. &gt;&gt; Yeah. Yeah. So about this um in 111"},{"start":1168.47,"text":"&gt;&gt; Yeah. Yeah. So about this um in 111"},{"start":1168.48,"text":"&gt;&gt; Yeah. Yeah. So about this um in 111 there is"},{"start":1170.549,"text":"there is"},{"start":1170.559,"text":"there is I think it's this option"},{"start":1174.789,"text":"I think it's this option"},{"start":1174.799,"text":"I think it's this option if I remember correctly. Uh"},{"start":1185.19,"text":"yeah. So I think it's in compile modules"},{"start":1185.2,"text":"yeah. So I think it's in compile modules equal to strict"},{"start":1193.75,"text":"&gt;&gt; I think like in the past also I just"},{"start":1193.76,"text":"&gt;&gt; I think like in the past also I just turned off pre-ompilation that then like"},{"start":1201.19,"text":"&gt;&gt; so that then each note is just doing the"},{"start":1201.2,"text":"&gt;&gt; so that then each note is just doing the the compilation and you're not trying to"},{"start":1202.95,"text":"the compilation and you're not trying to"},{"start":1202.96,"text":"the compilation and you're not trying to like"},{"start":1203.99,"text":"like"},{"start":1204.0,"text":"like &gt;&gt; No. So the suggestion is to do it once"},{"start":1206.63,"text":"&gt;&gt; No. So the suggestion is to do it once"},{"start":1206.64,"text":"&gt;&gt; No. So the suggestion is to do it once if possible on the login node and then"},{"start":1209.83,"text":"if possible on the login node and then"},{"start":1209.84,"text":"if possible on the login node and then uh when you run your job on the computer"},{"start":1212.31,"text":"uh when you run your job on the computer"},{"start":1212.32,"text":"uh when you run your job on the computer node use this um compiled modules equal"},{"start":1215.51,"text":"node use this um compiled modules equal"},{"start":1215.52,"text":"node use this um compiled modules equal to strict if I remember is the right one"},{"start":1218.31,"text":"to strict if I remember is the right one"},{"start":1218.32,"text":"to strict if I remember is the right one uh which errors out if you are trying to"},{"start":1221.59,"text":"uh which errors out if you are trying to"},{"start":1221.6,"text":"uh which errors out if you are trying to load a module which doesn't have a pkg"},{"start":1223.669,"text":"load a module which doesn't have a pkg"},{"start":1223.679,"text":"load a module which doesn't have a pkg image already and so it doesn't even try"},{"start":1226.71,"text":"image already and so it doesn't even try"},{"start":1226.72,"text":"image already and so it doesn't even try to to to compile any errors immediately"},{"start":1228.71,"text":"to to to compile any errors immediately"},{"start":1228.72,"text":"to to to compile any errors immediately and so you can immediately see that"},{"start":1230.149,"text":"and so you can immediately see that"},{"start":1230.159,"text":"and so you can immediately see that something is wrong and you can restart"},{"start":1231.75,"text":"something is wrong and you can restart"},{"start":1231.76,"text":"something is wrong and you can restart your job. Um yeah this was my strategy."},{"start":1234.47,"text":"your job. Um yeah this was my strategy."},{"start":1234.48,"text":"your job. Um yeah this was my strategy. So like compile on the login node if"},{"start":1236.31,"text":"So like compile on the login node if"},{"start":1236.32,"text":"So like compile on the login node if possible and run with compiled modules"},{"start":1239.99,"text":"possible and run with compiled modules"},{"start":1240.0,"text":"possible and run with compiled modules equal to strict and in in this way you"},{"start":1242.71,"text":"equal to strict and in in this way you"},{"start":1242.72,"text":"equal to strict and in in this way you don't run into the issue of multiple"},{"start":1245.43,"text":"don't run into the issue of multiple"},{"start":1245.44,"text":"don't run into the issue of multiple thousands hundreds of jobs uh trying to"},{"start":1248.63,"text":"thousands hundreds of jobs uh trying to"},{"start":1248.64,"text":"thousands hundreds of jobs uh trying to um step on each other. So yeah"},{"start":1264.39,"text":"I had a pre Oh, yeah. Yeah. By the way,"},{"start":1264.4,"text":"I had a pre Oh, yeah. Yeah. By the way, the thing that's currently in this"},{"start":1265.909,"text":"the thing that's currently in this"},{"start":1265.919,"text":"the thing that's currently in this space, it's currently uh keeping me up"},{"start":1269.27,"text":"space, it's currently uh keeping me up"},{"start":1269.28,"text":"space, it's currently uh keeping me up at night is the topic of cross"},{"start":1271.43,"text":"at night is the topic of cross"},{"start":1271.44,"text":"at night is the topic of cross compilation."},{"start":1272.95,"text":"compilation."},{"start":1272.96,"text":"compilation. Um"},{"start":1274.71,"text":"Um"},{"start":1274.72,"text":"Um uh what if your login node isn't the"},{"start":1278.07,"text":"uh what if your login node isn't the"},{"start":1278.08,"text":"uh what if your login node isn't the same architecture as your compute node,"},{"start":1280.549,"text":"same architecture as your compute node,"},{"start":1280.559,"text":"same architecture as your compute node, &gt;&gt; but what if all your high performance"},{"start":1281.909,"text":"&gt;&gt; but what if all your high performance"},{"start":1281.919,"text":"&gt;&gt; but what if all your high performance file systems on the computes are"},{"start":1284.789,"text":"file systems on the computes are"},{"start":1284.799,"text":"file systems on the computes are unsuitable for pre-ompilation? you know"},{"start":1288.31,"text":"unsuitable for pre-ompilation? you know"},{"start":1288.32,"text":"unsuitable for pre-ompilation? you know the these are the sort of things that"},{"start":1289.669,"text":"the these are the sort of things that"},{"start":1289.679,"text":"the these are the sort of things that scare one at night. Um and and the"},{"start":1293.029,"text":"scare one at night. Um and and the"},{"start":1293.039,"text":"scare one at night. Um and and the reason why I bring this up is also this"},{"start":1294.71,"text":"reason why I bring this up is also this"},{"start":1294.72,"text":"reason why I bring this up is also this is a pattern that we used to have with"},{"start":1297.27,"text":"is a pattern that we used to have with"},{"start":1297.28,"text":"is a pattern that we used to have with the good in the good old days of IBM."},{"start":1300.71,"text":"the good in the good old days of IBM."},{"start":1300.72,"text":"the good in the good old days of IBM. uh then we were very fortunate at"},{"start":1304.789,"text":"uh then we were very fortunate at"},{"start":1304.799,"text":"uh then we were very fortunate at um people realizing that it's a horrible"},{"start":1307.029,"text":"um people realizing that it's a horrible"},{"start":1307.039,"text":"um people realizing that it's a horrible design and now unfortunately I think"},{"start":1310.31,"text":"design and now unfortunately I think"},{"start":1310.32,"text":"design and now unfortunately I think it's due to cost optimization right you"},{"start":1313.909,"text":"it's due to cost optimization right you"},{"start":1313.919,"text":"it's due to cost optimization right you want your computes to have as slim as"},{"start":1316.31,"text":"want your computes to have as slim as"},{"start":1316.32,"text":"want your computes to have as slim as possible CPU nowadays but that's"},{"start":1319.19,"text":"possible CPU nowadays but that's"},{"start":1319.2,"text":"possible CPU nowadays but that's unpractical for the login so then you"},{"start":1321.669,"text":"unpractical for the login so then you"},{"start":1321.679,"text":"unpractical for the login so then you put a nice CPU on the login and you're"},{"start":1323.99,"text":"put a nice CPU on the login and you're"},{"start":1324.0,"text":"put a nice CPU on the login and you're trying to be nice to your users um by"},{"start":1327.029,"text":"trying to be nice to your users um by"},{"start":1327.039,"text":"trying to be nice to your users um by putting those on um yeah So, so as long"},{"start":1330.789,"text":"putting those on um yeah So, so as long"},{"start":1330.799,"text":"putting those on um yeah So, so as long as the um"},{"start":1332.95,"text":"as the um"},{"start":1332.96,"text":"as the um so anyway I think you you have uh you"},{"start":1335.51,"text":"so anyway I think you you have uh you"},{"start":1335.52,"text":"so anyway I think you you have uh you have more experience with that. Right"},{"start":1337.19,"text":"have more experience with that. Right"},{"start":1337.2,"text":"have more experience with that. Right now we we don't have this problem but um"},{"start":1339.35,"text":"now we we don't have this problem but um"},{"start":1339.36,"text":"now we we don't have this problem but um we might have it in the future."},{"start":1340.95,"text":"we might have it in the future."},{"start":1340.96,"text":"we might have it in the future. &gt;&gt; Yeah. So if your login node is the same"},{"start":1344.149,"text":"&gt;&gt; Yeah. So if your login node is the same"},{"start":1344.159,"text":"&gt;&gt; Yeah. So if your login node is the same architecture but not same micro"},{"start":1345.909,"text":"architecture but not same micro"},{"start":1345.919,"text":"architecture but not same micro architecture as a comput node follow"},{"start":1348.07,"text":"architecture as a comput node follow"},{"start":1348.08,"text":"architecture as a comput node follow this"},{"start":1349.59,"text":"this"},{"start":1349.6,"text":"this if it's a different architecture like uh"},{"start":1351.59,"text":"if it's a different architecture like uh"},{"start":1351.6,"text":"if it's a different architecture like uh on fug for example the login node is x86"},{"start":1354.47,"text":"on fug for example the login node is x86"},{"start":1354.48,"text":"on fug for example the login node is x86 comput nodes are ar 64 it's like"},{"start":1356.47,"text":"comput nodes are ar 64 it's like"},{"start":1356.48,"text":"comput nodes are ar 64 it's like completely different uh there is no way"},{"start":1359.27,"text":"completely different uh there is no way"},{"start":1359.28,"text":"completely different uh there is no way like you need to do sepilation on a"},{"start":1361.43,"text":"like you need to do sepilation on a"},{"start":1361.44,"text":"like you need to do sepilation on a computer node"},{"start":1363.83,"text":"computer node"},{"start":1363.84,"text":"computer node but yeah on systems where at least it's"},{"start":1367.029,"text":"but yeah on systems where at least it's"},{"start":1367.039,"text":"but yeah on systems where at least it's the same architecture but not same uh"},{"start":1368.95,"text":"the same architecture but not same uh"},{"start":1368.96,"text":"the same architecture but not same uh micro architecture there is is"},{"start":1370.95,"text":"micro architecture there is is"},{"start":1370.96,"text":"micro architecture there is is environment variable uh Julia CPU target"},{"start":1373.51,"text":"environment variable uh Julia CPU target"},{"start":1373.52,"text":"environment variable uh Julia CPU target as you can set and this actually nice I"},{"start":1376.07,"text":"as you can set and this actually nice I"},{"start":1376.08,"text":"as you can set and this actually nice I think Julia is the only language that I"},{"start":1377.83,"text":"think Julia is the only language that I"},{"start":1377.84,"text":"think Julia is the only language that I know where uh u multi versioning is very"},{"start":1381.11,"text":"know where uh u multi versioning is very"},{"start":1381.12,"text":"know where uh u multi versioning is very nice you don't need to change your code"},{"start":1383.11,"text":"nice you don't need to change your code"},{"start":1383.12,"text":"nice you don't need to change your code you only it's only a option for the"},{"start":1384.95,"text":"you only it's only a option for the"},{"start":1384.96,"text":"you only it's only a option for the compiler where you can automatically"},{"start":1386.63,"text":"compiler where you can automatically"},{"start":1386.64,"text":"compiler where you can automatically compile uh native code for multiple"},{"start":1389.27,"text":"compile uh native code for multiple"},{"start":1389.28,"text":"compile uh native code for multiple micro architectures without again"},{"start":1391.35,"text":"micro architectures without again"},{"start":1391.36,"text":"micro architectures without again changing your code"},{"start":1393.909,"text":"changing your code"},{"start":1393.919,"text":"changing your code and yeah this is super useful and yeah"},{"start":1397.59,"text":"and yeah this is super useful and yeah"},{"start":1397.6,"text":"and yeah this is super useful and yeah see this again this is on jhpc github.io"},{"start":1402.47,"text":"see this again this is on jhpc github.io"},{"start":1402.48,"text":"see this again this is on jhpc github.io um yeah this is very useful for um"},{"start":1406.63,"text":"um yeah this is very useful for um"},{"start":1406.64,"text":"um yeah this is very useful for um dealing with the systems"},{"start":1410.71,"text":"dealing with the systems"},{"start":1410.72,"text":"dealing with the systems &gt;&gt; and if you have"},{"start":1412.95,"text":"&gt;&gt; and if you have"},{"start":1412.96,"text":"&gt;&gt; and if you have motivated interns who want to help"},{"start":1416.39,"text":"motivated interns who want to help"},{"start":1416.4,"text":"motivated interns who want to help enable proper cross compilation"},{"start":1419.83,"text":"enable proper cross compilation"},{"start":1419.84,"text":"enable proper cross compilation &gt;&gt; yeah that was a question yesterday"},{"start":1421.83,"text":"&gt;&gt; yeah that was a question yesterday"},{"start":1421.84,"text":"&gt;&gt; yeah that was a question yesterday &gt;&gt; yeah um I I'm h I don't have buckets of"},{"start":1424.789,"text":"&gt;&gt; yeah um I I'm h I don't have buckets of"},{"start":1424.799,"text":"&gt;&gt; yeah um I I'm h I don't have buckets of I think what they said is if you have"},{"start":1426.31,"text":"I think what they said is if you have"},{"start":1426.32,"text":"I think what they said is if you have bags of cash we can help you don't have"},{"start":1429.11,"text":"bags of cash we can help you don't have"},{"start":1429.12,"text":"bags of cash we can help you don't have bags of cash but I have open intern"},{"start":1432.95,"text":"bags of cash but I have open intern"},{"start":1432.96,"text":"bags of cash but I have open intern positions. So uh"},{"start":1446.549,"text":"anything else this does not have to be"},{"start":1446.559,"text":"anything else this does not have to be about premp."},{"start":1455.51,"text":"So this relates to cross compilation but"},{"start":1455.52,"text":"So this relates to cross compilation but for networks right many users will"},{"start":1458.39,"text":"for networks right many users will"},{"start":1458.4,"text":"for networks right many users will choose CX or some other network support."},{"start":1463.43,"text":"choose CX or some other network support."},{"start":1463.44,"text":"choose CX or some other network support. Um, and this relates to binary builder."},{"start":1466.87,"text":"Um, and this relates to binary builder."},{"start":1466.88,"text":"Um, and this relates to binary builder. So, OpenMPI supports UCX in binary"},{"start":1470.39,"text":"So, OpenMPI supports UCX in binary"},{"start":1470.4,"text":"So, OpenMPI supports UCX in binary builder. It's configured with it."},{"start":1472.07,"text":"builder. It's configured with it."},{"start":1472.08,"text":"builder. It's configured with it. However, Mitch is not."},{"start":1475.269,"text":"However, Mitch is not."},{"start":1475.279,"text":"However, Mitch is not. I think"},{"start":1477.35,"text":"I think"},{"start":1477.36,"text":"I think I don't know having a vast support"},{"start":1479.269,"text":"I don't know having a vast support"},{"start":1479.279,"text":"I don't know having a vast support matrix in order to have like different"},{"start":1481.83,"text":"matrix in order to have like different"},{"start":1481.84,"text":"matrix in order to have like different configuration options for like just"},{"start":1484.549,"text":"configuration options for like just"},{"start":1484.559,"text":"configuration options for like just expanding the matrix I think is"},{"start":1486.149,"text":"expanding the matrix I think is"},{"start":1486.159,"text":"expanding the matrix I think is important so you get the right JLL based"},{"start":1488.63,"text":"important so you get the right JLL based"},{"start":1488.64,"text":"important so you get the right JLL based off your preferences to support whatever"},{"start":1490.549,"text":"off your preferences to support whatever"},{"start":1490.559,"text":"off your preferences to support whatever network you have that's configured with"},{"start":1493.75,"text":"network you have that's configured with"},{"start":1493.76,"text":"network you have that's configured with I don't know if anybody else has"},{"start":1495.51,"text":"I don't know if anybody else has"},{"start":1495.52,"text":"I don't know if anybody else has opinions on this but that that's"},{"start":1496.95,"text":"opinions on this but that that's"},{"start":1496.96,"text":"opinions on this but that that's something"},{"start":1499.35,"text":"something"},{"start":1499.36,"text":"something &gt;&gt; I think I want to see"},{"start":1501.83,"text":"&gt;&gt; I think I want to see"},{"start":1501.84,"text":"&gt;&gt; I think I want to see &gt;&gt; so honestly we provide the gels else"},{"start":1505.029,"text":"&gt;&gt; so honestly we provide the gels else"},{"start":1505.039,"text":"&gt;&gt; so honestly we provide the gels else only for a starting point like like to"},{"start":1508.149,"text":"only for a starting point like like to"},{"start":1508.159,"text":"only for a starting point like like to to have a basic MPI and do something but"},{"start":1512.47,"text":"to have a basic MPI and do something but"},{"start":1512.48,"text":"to have a basic MPI and do something but if you have strong preferences you"},{"start":1513.909,"text":"if you have strong preferences you"},{"start":1513.919,"text":"if you have strong preferences you should really use the system API and we"},{"start":1516.149,"text":"should really use the system API and we"},{"start":1516.159,"text":"should really use the system API and we provide the option to to fall back on"},{"start":1518.07,"text":"provide the option to to fall back on"},{"start":1518.08,"text":"provide the option to to fall back on that um"},{"start":1521.19,"text":"that um"},{"start":1521.2,"text":"that um yeah I I don't think it's going to be"},{"start":1522.789,"text":"yeah I I don't think it's going to be"},{"start":1522.799,"text":"yeah I I don't think it's going to be very uh useful to just build hundreds of"},{"start":1527.029,"text":"very uh useful to just build hundreds of"},{"start":1527.039,"text":"very uh useful to just build hundreds of different configurations because with"},{"start":1528.31,"text":"different configurations because with"},{"start":1528.32,"text":"different configurations because with NPI you can"},{"start":1529.19,"text":"NPI you can"},{"start":1529.2,"text":"NPI you can &gt;&gt; yeah it's a very expansive matrix but"},{"start":1532.07,"text":"&gt;&gt; yeah it's a very expansive matrix but"},{"start":1532.08,"text":"&gt;&gt; yeah it's a very expansive matrix but specifically for different networks"},{"start":1534.31,"text":"specifically for different networks"},{"start":1534.32,"text":"specifically for different networks I was just assuming that whatever user"},{"start":1536.63,"text":"I was just assuming that whatever user"},{"start":1536.64,"text":"I was just assuming that whatever user just doesn't have a local build and I"},{"start":1539.11,"text":"just doesn't have a local build and I"},{"start":1539.12,"text":"just doesn't have a local build and I mean of course you could configure your"},{"start":1540.63,"text":"mean of course you could configure your"},{"start":1540.64,"text":"mean of course you could configure your custom build but"},{"start":1542.23,"text":"custom build but"},{"start":1542.24,"text":"custom build but &gt;&gt; yeah I mean so HPC usually you do on"},{"start":1545.35,"text":"&gt;&gt; yeah I mean so HPC usually you do on"},{"start":1545.36,"text":"&gt;&gt; yeah I mean so HPC usually you do on systems where already NPI is provided"},{"start":1547.83,"text":"systems where already NPI is provided"},{"start":1547.84,"text":"systems where already NPI is provided but that's the usual case if that's not"},{"start":1550.87,"text":"but that's the usual case if that's not"},{"start":1550.88,"text":"but that's the usual case if that's not the case for you"},{"start":1551.51,"text":"the case for you"},{"start":1551.52,"text":"the case for you &gt;&gt; it's a single node with multiple GPUs or"},{"start":1553.83,"text":"&gt;&gt; it's a single node with multiple GPUs or"},{"start":1553.84,"text":"&gt;&gt; it's a single node with multiple GPUs or something you're launching multiple NPI"},{"start":1555.83,"text":"something you're launching multiple NPI"},{"start":1555.84,"text":"something you're launching multiple NPI procs but there's a UCX network or"},{"start":1557.83,"text":"procs but there's a UCX network or"},{"start":1557.84,"text":"procs but there's a UCX network or something something's happening I don't"},{"start":1560.07,"text":"something something's happening I don't"},{"start":1560.08,"text":"something something's happening I don't know that that's that's the mindset I'm"},{"start":1561.909,"text":"know that that's that's the mindset I'm"},{"start":1561.919,"text":"know that that's that's the mindset I'm looking"},{"start":1570.789,"text":"So as a followup, are you looking at"},{"start":1570.799,"text":"So as a followup, are you looking at uh so you want your so as Mos said um"},{"start":1574.47,"text":"uh so you want your so as Mos said um"},{"start":1574.48,"text":"uh so you want your so as Mos said um the the JLS are there for when you"},{"start":1577.75,"text":"the the JLS are there for when you"},{"start":1577.76,"text":"the the JLS are there for when you writing some code you want to test it on"},{"start":1579.909,"text":"writing some code you want to test it on"},{"start":1579.919,"text":"writing some code you want to test it on your laptop or or like you know want to"},{"start":1581.75,"text":"your laptop or or like you know want to"},{"start":1581.76,"text":"your laptop or or like you know want to test it locally first. So um you're not"},{"start":1583.909,"text":"test it locally first. So um you're not"},{"start":1583.919,"text":"test it locally first. So um you're not actually touching the network if you're"},{"start":1586.71,"text":"actually touching the network if you're"},{"start":1586.72,"text":"actually touching the network if you're on a single node, right?"},{"start":1589.029,"text":"on a single node, right?"},{"start":1589.039,"text":"on a single node, right? Um so"},{"start":1592.07,"text":"Um so"},{"start":1592.08,"text":"Um so um so when you're touching the network I"},{"start":1594.789,"text":"um so when you're touching the network I"},{"start":1594.799,"text":"um so when you're touching the network I think the NPI community has actually"},{"start":1596.87,"text":"think the NPI community has actually"},{"start":1596.88,"text":"think the NPI community has actually done a lot of progress with the ABI"},{"start":1599.269,"text":"done a lot of progress with the ABI"},{"start":1599.279,"text":"done a lot of progress with the ABI compatibility"},{"start":1600.789,"text":"compatibility"},{"start":1600.799,"text":"compatibility so that it is in theory possible uh well"},{"start":1603.99,"text":"so that it is in theory possible uh well"},{"start":1604.0,"text":"so that it is in theory possible uh well with NPI trampoline it's practically"},{"start":1607.35,"text":"with NPI trampoline it's practically"},{"start":1607.36,"text":"with NPI trampoline it's practically possible and then in I'm going to say"},{"start":1609.19,"text":"possible and then in I'm going to say"},{"start":1609.2,"text":"possible and then in I'm going to say like five years or so when uh like the"},{"start":1611.59,"text":"like five years or so when uh like the"},{"start":1611.6,"text":"like five years or so when uh like the the ABI standard has been adopted"},{"start":1614.07,"text":"the ABI standard has been adopted"},{"start":1614.08,"text":"the ABI standard has been adopted already. So uh we basically just waiting"},{"start":1616.71,"text":"already. So uh we basically just waiting"},{"start":1616.72,"text":"already. So uh we basically just waiting for the older um"},{"start":1618.549,"text":"for the older um"},{"start":1618.559,"text":"for the older um uh MPIs to sort of filter out of the"},{"start":1621.11,"text":"uh MPIs to sort of filter out of the"},{"start":1621.12,"text":"uh MPIs to sort of filter out of the ecosystem and um then it's perfectly"},{"start":1624.39,"text":"ecosystem and um then it's perfectly"},{"start":1624.4,"text":"ecosystem and um then it's perfectly reasonable for you to um uh take a um an"},{"start":1629.269,"text":"reasonable for you to um uh take a um an"},{"start":1629.279,"text":"reasonable for you to um uh take a um an NPI I mean like your NPI code doesn't"},{"start":1632.31,"text":"NPI I mean like your NPI code doesn't"},{"start":1632.32,"text":"NPI I mean like your NPI code doesn't doesn't explicitly talk to UCX anyway"},{"start":1634.87,"text":"doesn't explicitly talk to UCX anyway"},{"start":1634.88,"text":"doesn't explicitly talk to UCX anyway right so then if your system has let's"},{"start":1637.909,"text":"right so then if your system has let's"},{"start":1637.919,"text":"right so then if your system has let's say it's an Nvidia system or Melanox and"},{"start":1640.789,"text":"say it's an Nvidia system or Melanox and"},{"start":1640.799,"text":"say it's an Nvidia system or Melanox and um it it it supports UCX and has UCX"},{"start":1643.59,"text":"um it it it supports UCX and has UCX"},{"start":1643.6,"text":"um it it it supports UCX and has UCX preconfigured then you will just"},{"start":1646.07,"text":"preconfigured then you will just"},{"start":1646.08,"text":"preconfigured then you will just seamlessly use that"},{"start":1648.63,"text":"seamlessly use that"},{"start":1648.64,"text":"seamlessly use that and and you yeah I'm I kind so so that's"},{"start":1651.51,"text":"and and you yeah I'm I kind so so that's"},{"start":1651.52,"text":"and and you yeah I'm I kind so so that's what sort of where where the question is"},{"start":1653.19,"text":"what sort of where where the question is"},{"start":1653.2,"text":"what sort of where where the question is uh why why you want this like yeah"},{"start":1658.07,"text":"uh why why you want this like yeah"},{"start":1658.08,"text":"uh why why you want this like yeah &gt;&gt; I I think it's more of like a mindset"},{"start":1661.269,"text":"&gt;&gt; I I think it's more of like a mindset"},{"start":1661.279,"text":"&gt;&gt; I I think it's more of like a mindset rather than why so so I guess it's it's"},{"start":1666.149,"text":"rather than why so so I guess it's it's"},{"start":1666.159,"text":"rather than why so so I guess it's it's reasonable to assume that a user if they"},{"start":1668.39,"text":"reasonable to assume that a user if they"},{"start":1668.4,"text":"reasonable to assume that a user if they want these feature sets that they'll"},{"start":1670.23,"text":"want these feature sets that they'll"},{"start":1670.24,"text":"want these feature sets that they'll have their own custom configuration"},{"start":1672.149,"text":"have their own custom configuration"},{"start":1672.159,"text":"have their own custom configuration option and supplying the capability to"},{"start":1674.95,"text":"option and supplying the capability to"},{"start":1674.96,"text":"option and supplying the capability to for the for the user to like reconigure"},{"start":1677.51,"text":"for the for the user to like reconigure"},{"start":1677.52,"text":"for the for the user to like reconigure however they want. I mean, that's"},{"start":1679.909,"text":"however they want. I mean, that's"},{"start":1679.919,"text":"however they want. I mean, that's necessary instead of supporting trying"},{"start":1681.83,"text":"necessary instead of supporting trying"},{"start":1681.84,"text":"necessary instead of supporting trying to support a vast matrix. I think that"},{"start":1684.31,"text":"to support a vast matrix. I think that"},{"start":1684.32,"text":"to support a vast matrix. I think that gets very complicated. So, yeah. So, I"},{"start":1687.35,"text":"gets very complicated. So, yeah. So, I"},{"start":1687.36,"text":"gets very complicated. So, yeah. So, I I'll probably just allow users and just"},{"start":1691.19,"text":"I'll probably just allow users and just"},{"start":1691.2,"text":"I'll probably just allow users and just keep on using the JLS as defaults. I"},{"start":1694.71,"text":"keep on using the JLS as defaults. I"},{"start":1694.72,"text":"keep on using the JLS as defaults. I think that's a good solution in the"},{"start":1697.11,"text":"think that's a good solution in the"},{"start":1697.12,"text":"think that's a good solution in the sense of library developers."},{"start":1704.389,"text":"&gt;&gt; So, I was kind of nodding on the jealous"},{"start":1704.399,"text":"&gt;&gt; So, I was kind of nodding on the jealous default thing. Um so the approach that"},{"start":1708.31,"text":"default thing. Um so the approach that"},{"start":1708.32,"text":"default thing. Um so the approach that uh MPI and CUDA and and and the approach"},{"start":1710.63,"text":"uh MPI and CUDA and and and the approach"},{"start":1710.64,"text":"uh MPI and CUDA and and and the approach that I've kind of advocated for is you"},{"start":1713.43,"text":"that I've kind of advocated for is you"},{"start":1713.44,"text":"that I've kind of advocated for is you have global preferences on your on"},{"start":1715.269,"text":"have global preferences on your on"},{"start":1715.279,"text":"have global preferences on your on wherever you you run and then you have"},{"start":1717.909,"text":"wherever you you run and then you have"},{"start":1717.919,"text":"wherever you you run and then you have like a default that assumes something"},{"start":1720.71,"text":"like a default that assumes something"},{"start":1720.72,"text":"like a default that assumes something very local and generic like you know a"},{"start":1724.23,"text":"very local and generic like you know a"},{"start":1724.24,"text":"very local and generic like you know a Linux or a Mac uh and and uh if the HPC"},{"start":1728.549,"text":"Linux or a Mac uh and and uh if the HPC"},{"start":1728.559,"text":"Linux or a Mac uh and and uh if the HPC center doesn't provide global"},{"start":1729.669,"text":"center doesn't provide global"},{"start":1729.679,"text":"center doesn't provide global preferences then that's kind of their"},{"start":1731.19,"text":"preferences then that's kind of their"},{"start":1731.2,"text":"preferences then that's kind of their fault, right? They're dropping the ball"},{"start":1733.35,"text":"fault, right? They're dropping the ball"},{"start":1733.36,"text":"fault, right? They're dropping the ball there. Uh and so yeah, I I would agree"},{"start":1737.269,"text":"there. Uh and so yeah, I I would agree"},{"start":1737.279,"text":"there. Uh and so yeah, I I would agree with you on that."},{"start":1746.549,"text":"And any other ideas we that we should be"},{"start":1746.559,"text":"And any other ideas we that we should be discussing"},{"start":1749.029,"text":"discussing"},{"start":1749.039,"text":"discussing any complaints?"},{"start":1752.389,"text":"any complaints?"},{"start":1752.399,"text":"any complaints? No."},{"start":1752.87,"text":"No."},{"start":1752.88,"text":"No. &gt;&gt; Or something that worked well?"},{"start":1754.31,"text":"&gt;&gt; Or something that worked well?"},{"start":1754.32,"text":"&gt;&gt; Or something that worked well? &gt;&gt; Yeah. I I will I say that I also get"},{"start":1757.19,"text":"&gt;&gt; Yeah. I I will I say that I also get"},{"start":1757.2,"text":"&gt;&gt; Yeah. I I will I say that I also get emails from users saying like I really"},{"start":1759.35,"text":"emails from users saying like I really"},{"start":1759.36,"text":"emails from users saying like I really like the fact that you have global"},{"start":1760.789,"text":"like the fact that you have global"},{"start":1760.799,"text":"like the fact that you have global preferences and I just go import npi and"},{"start":1763.83,"text":"preferences and I just go import npi and"},{"start":1763.84,"text":"preferences and I just go import npi and I don't have to like in Oakidge it's"},{"start":1765.909,"text":"I don't have to like in Oakidge it's"},{"start":1765.919,"text":"I don't have to like in Oakidge it's like the documentation says run this"},{"start":1767.83,"text":"like the documentation says run this"},{"start":1767.84,"text":"like the documentation says run this snippet of code and uh you can forget"},{"start":1771.029,"text":"snippet of code and uh you can forget"},{"start":1771.039,"text":"snippet of code and uh you can forget that like and then your code just won't"},{"start":1773.269,"text":"that like and then your code just won't"},{"start":1773.279,"text":"that like and then your code just won't work uh or your computer just went"},{"start":1777.909,"text":"work uh or your computer just went"},{"start":1777.919,"text":"work uh or your computer just went all matrix"},{"start":1779.669,"text":"all matrix"},{"start":1779.679,"text":"all matrix uh anyway so so yeah I also get like"},{"start":1781.99,"text":"uh anyway so so yeah I also get like"},{"start":1782.0,"text":"uh anyway so so yeah I also get like people saying it's wonderful that that"},{"start":1783.35,"text":"people saying it's wonderful that that"},{"start":1783.36,"text":"people saying it's wonderful that that this just works"},{"start":1789.43,"text":"So does preferences automatically check"},{"start":1789.44,"text":"So does preferences automatically check the global preferences like when you"},{"start":1791.909,"text":"the global preferences like when you"},{"start":1791.919,"text":"the global preferences like when you when you check"},{"start":1792.87,"text":"when you check"},{"start":1792.88,"text":"when you check &gt;&gt; Yeah. So I think it's a stack. No. So"},{"start":1794.549,"text":"&gt;&gt; Yeah. So I think it's a stack. No. So"},{"start":1794.559,"text":"&gt;&gt; Yeah. So I think it's a stack. No. So you have the global and then if you have"},{"start":1796.31,"text":"you have the global and then if you have"},{"start":1796.32,"text":"you have the global and then if you have a local environment uh that takes over"},{"start":1799.19,"text":"a local environment uh that takes over"},{"start":1799.2,"text":"a local environment uh that takes over the global preferences but you can have"},{"start":1801.669,"text":"the global preferences but you can have"},{"start":1801.679,"text":"the global preferences but you can have multiple of them. Yes."},{"start":1803.269,"text":"multiple of them. Yes."},{"start":1803.279,"text":"multiple of them. Yes. &gt;&gt; Okay."},{"start":1808.789,"text":"&gt;&gt; And and you can disable that. But like"},{"start":1808.799,"text":"&gt;&gt; And and you can disable that. But like the idea is uh"},{"start":1817.19,"text":"Yeah. Yeah."},{"start":1817.2,"text":"Yeah. Yeah. &gt;&gt; Yeah. Ex. And that's also what so so the"},{"start":1819.269,"text":"&gt;&gt; Yeah. Ex. And that's also what so so the"},{"start":1819.279,"text":"&gt;&gt; Yeah. Ex. And that's also what so so the the point was like checking preferences"},{"start":1821.029,"text":"the point was like checking preferences"},{"start":1821.039,"text":"the point was like checking preferences and if there's no preference then it's a"},{"start":1822.47,"text":"and if there's no preference then it's a"},{"start":1822.48,"text":"and if there's no preference then it's a JL and Yeah."},{"start":1825.51,"text":"JL and Yeah."},{"start":1825.52,"text":"JL and Yeah. &gt;&gt; Yeah."},{"start":1827.59,"text":"&gt;&gt; Yeah."},{"start":1827.6,"text":"&gt;&gt; Yeah. So one thing with uh that I like a lot"},{"start":1829.669,"text":"So one thing with uh that I like a lot"},{"start":1829.679,"text":"So one thing with uh that I like a lot about preferences that um in the MPI"},{"start":1833.19,"text":"about preferences that um in the MPI"},{"start":1833.2,"text":"about preferences that um in the MPI preferences you can specify the absolute"},{"start":1834.95,"text":"preferences you can specify the absolute"},{"start":1834.96,"text":"preferences you can specify the absolute path to the MPI library that you want to"},{"start":1836.789,"text":"path to the MPI library that you want to"},{"start":1836.799,"text":"path to the MPI library that you want to load. And so you don't need to remember"},{"start":1838.31,"text":"load. And so you don't need to remember"},{"start":1838.32,"text":"load. And so you don't need to remember to load the module which I always forget"},{"start":1841.029,"text":"to load the module which I always forget"},{"start":1841.039,"text":"to load the module which I always forget when I do my jobs. He said all the"},{"start":1843.99,"text":"when I do my jobs. He said all the"},{"start":1844.0,"text":"when I do my jobs. He said all the information is in the preference file."},{"start":1845.99,"text":"information is in the preference file."},{"start":1846.0,"text":"information is in the preference file. It finds the MPI library there. I I"},{"start":1848.31,"text":"It finds the MPI library there. I I"},{"start":1848.32,"text":"It finds the MPI library there. I I don't need to remember to module load"},{"start":1849.99,"text":"don't need to remember to module load"},{"start":1850.0,"text":"don't need to remember to module load whatever. So that I find very nice"},{"start":1861.669,"text":"also if people want to share like cool"},{"start":1861.679,"text":"also if people want to share like cool things that they've done."},{"start":1871.909,"text":"Oh wow, crickets. HPC is not cool. I'm"},{"start":1871.919,"text":"Oh wow, crickets. HPC is not cool. I'm sorry. Too early in the morning."},{"start":1886.07,"text":"Um I I could share my experience setting"},{"start":1886.08,"text":"Um I I could share my experience setting up Julia um on on my cluster. Um"},{"start":1891.59,"text":"up Julia um on on my cluster. Um"},{"start":1891.6,"text":"up Julia um on on my cluster. Um &gt;&gt; yeah. Yeah, exactly. This is on Maxwell."},{"start":1893.83,"text":"&gt;&gt; yeah. Yeah, exactly. This is on Maxwell."},{"start":1893.84,"text":"&gt;&gt; yeah. Yeah, exactly. This is on Maxwell. Um"},{"start":1895.59,"text":"Um"},{"start":1895.6,"text":"Um and in general, I think it was a good"},{"start":1898.47,"text":"and in general, I think it was a good"},{"start":1898.48,"text":"and in general, I think it was a good experience. It took a long time to go"},{"start":1901.83,"text":"experience. It took a long time to go"},{"start":1901.84,"text":"experience. It took a long time to go through the documentation. I had a look"},{"start":1903.269,"text":"through the documentation. I had a look"},{"start":1903.279,"text":"through the documentation. I had a look at the Julia HPC website. That was quite"},{"start":1905.43,"text":"at the Julia HPC website. That was quite"},{"start":1905.44,"text":"at the Julia HPC website. That was quite helpful. Um,"},{"start":1908.31,"text":"helpful. Um,"},{"start":1908.32,"text":"helpful. Um, I think I spent more time customizing"},{"start":1911.509,"text":"I think I spent more time customizing"},{"start":1911.519,"text":"I think I spent more time customizing environment variables for individual"},{"start":1913.909,"text":"environment variables for individual"},{"start":1913.919,"text":"environment variables for individual packages than for Julia itself. So I I"},{"start":1916.789,"text":"packages than for Julia itself. So I I"},{"start":1916.799,"text":"packages than for Julia itself. So I I set up environment variables for things"},{"start":1918.47,"text":"set up environment variables for things"},{"start":1918.48,"text":"set up environment variables for things like Python call and revise and and so"},{"start":1921.59,"text":"like Python call and revise and and so"},{"start":1921.6,"text":"like Python call and revise and and so on. Um,"},{"start":1924.149,"text":"on. Um,"},{"start":1924.159,"text":"on. Um, installing CUDA was actually amazingly"},{"start":1926.95,"text":"installing CUDA was actually amazingly"},{"start":1926.96,"text":"installing CUDA was actually amazingly simple once I figured out the"},{"start":1928.23,"text":"simple once I figured out the"},{"start":1928.24,"text":"simple once I figured out the preferences system."},{"start":1930.23,"text":"preferences system."},{"start":1930.24,"text":"preferences system. um like we also have to manage like um"},{"start":1936.149,"text":"um like we also have to manage like um"},{"start":1936.159,"text":"um like we also have to manage like um GPU aware PyTorch installations and"},{"start":1939.59,"text":"GPU aware PyTorch installations and"},{"start":1939.6,"text":"GPU aware PyTorch installations and those are quite a bit more difficult"},{"start":1941.669,"text":"those are quite a bit more difficult"},{"start":1941.679,"text":"those are quite a bit more difficult than using CUDA. So I'm I'm very"},{"start":1943.59,"text":"than using CUDA. So I'm I'm very"},{"start":1943.6,"text":"than using CUDA. So I'm I'm very impressed that this all works so well."},{"start":1945.99,"text":"impressed that this all works so well."},{"start":1946.0,"text":"impressed that this all works so well. Um yeah, that's it."},{"start":1948.789,"text":"Um yeah, that's it."},{"start":1948.799,"text":"Um yeah, that's it. &gt;&gt; Thanks."},{"start":1951.75,"text":"&gt;&gt; Thanks."},{"start":1951.76,"text":"&gt;&gt; Thanks. &gt;&gt; I I want to um can you uh I want to show"},{"start":1955.669,"text":"&gt;&gt; I I want to um can you uh I want to show"},{"start":1955.679,"text":"&gt;&gt; I I want to um can you uh I want to show something. So thanks uh and yeah, I want"},{"start":1957.59,"text":"something. So thanks uh and yeah, I want"},{"start":1957.6,"text":"something. So thanks uh and yeah, I want to show something. If you go to the"},{"start":1959.029,"text":"to show something. If you go to the"},{"start":1959.039,"text":"to show something. If you go to the nurse documentation,"},{"start":1961.669,"text":"nurse documentation,"},{"start":1961.679,"text":"nurse documentation, uh this is the thing that that that that"},{"start":1964.07,"text":"uh this is the thing that that that that"},{"start":1964.08,"text":"uh this is the thing that that that that always makes me not like uh Yeah. And"},{"start":1968.31,"text":"always makes me not like uh Yeah. And"},{"start":1968.32,"text":"always makes me not like uh Yeah. And then if you uh if you just search for"},{"start":1970.95,"text":"then if you uh if you just search for"},{"start":1970.96,"text":"then if you uh if you just search for Python in there,"},{"start":1983.11,"text":"that one, I think. Um"},{"start":1983.12,"text":"that one, I think. Um and you scroll down. They've made it"},{"start":1986.23,"text":"and you scroll down. They've made it"},{"start":1986.24,"text":"and you scroll down. They've made it nicer. So now Try try um parallel Python"},{"start":1991.11,"text":"nicer. So now Try try um parallel Python"},{"start":1991.12,"text":"nicer. So now Try try um parallel Python in the side panel there. Uh"},{"start":1995.11,"text":"in the side panel there. Uh"},{"start":1995.12,"text":"in the side panel there. Uh yeah."},{"start":1997.19,"text":"yeah."},{"start":1997.2,"text":"yeah. Anyway, I this used to be Oh, yeah. Here"},{"start":1999.35,"text":"Anyway, I this used to be Oh, yeah. Here"},{"start":1999.36,"text":"Anyway, I this used to be Oh, yeah. Here we go. And then you scroll down to that"},{"start":2000.63,"text":"we go. And then you scroll down to that"},{"start":2000.64,"text":"we go. And then you scroll down to that orange box."},{"start":2002.47,"text":"orange box."},{"start":2002.48,"text":"orange box. Uh"},{"start":2003.669,"text":"Uh"},{"start":2003.679,"text":"Uh &gt;&gt; here."},{"start":2004.389,"text":"&gt;&gt; here."},{"start":2004.399,"text":"&gt;&gt; here. &gt;&gt; Yeah. So, so there this is the stuff"},{"start":2007.029,"text":"&gt;&gt; Yeah. So, so there this is the stuff"},{"start":2007.039,"text":"&gt;&gt; Yeah. So, so there this is the stuff that that I this is not even the most"},{"start":2008.789,"text":"that that I this is not even the most"},{"start":2008.799,"text":"that that I this is not even the most egregious thing, but it's like um the"},{"start":2011.59,"text":"egregious thing, but it's like um the"},{"start":2011.6,"text":"egregious thing, but it's like um the top the top line, the gray box. That's"},{"start":2013.509,"text":"top the top line, the gray box. That's"},{"start":2013.519,"text":"top the top line, the gray box. That's the sort of thing that a user would do"},{"start":2015.35,"text":"the sort of thing that a user would do"},{"start":2015.36,"text":"the sort of thing that a user would do anyway because that's what they know."},{"start":2017.19,"text":"anyway because that's what they know."},{"start":2017.2,"text":"anyway because that's what they know. And then they would have had to know to"},{"start":2019.11,"text":"And then they would have had to know to"},{"start":2019.12,"text":"And then they would have had to know to navigate three levels deep to find that"},{"start":2021.909,"text":"navigate three levels deep to find that"},{"start":2021.919,"text":"navigate three levels deep to find that big orange box telling them to do"},{"start":2023.509,"text":"big orange box telling them to do"},{"start":2023.519,"text":"big orange box telling them to do something slightly different. And then"},{"start":2025.509,"text":"something slightly different. And then"},{"start":2025.519,"text":"something slightly different. And then if you I think scroll down. Oh yeah,"},{"start":2028.07,"text":"if you I think scroll down. Oh yeah,"},{"start":2028.08,"text":"if you I think scroll down. Oh yeah, install NPI4 PI. Uh like um so there's a"},{"start":2032.63,"text":"install NPI4 PI. Uh like um so there's a"},{"start":2032.64,"text":"install NPI4 PI. Uh like um so there's a whole NPI for Pi section. Um yeah, if"},{"start":2035.83,"text":"whole NPI for Pi section. Um yeah, if"},{"start":2035.84,"text":"whole NPI for Pi section. Um yeah, if you keep scrolling down a bit."},{"start":2038.47,"text":"you keep scrolling down a bit."},{"start":2038.48,"text":"you keep scrolling down a bit. Um"},{"start":2040.47,"text":"Um"},{"start":2040.48,"text":"Um uh keep going, keep going, keep going."},{"start":2042.23,"text":"uh keep going, keep going, keep going."},{"start":2042.24,"text":"uh keep going, keep going, keep going. Oh, go up again. Uh here there's another"},{"start":2045.75,"text":"Oh, go up again. Uh here there's another"},{"start":2045.76,"text":"Oh, go up again. Uh here there's another one. do not do this. And this is really"},{"start":2047.99,"text":"one. do not do this. And this is really"},{"start":2048.0,"text":"one. do not do this. And this is really what what grinds my gears because, you"},{"start":2050.069,"text":"what what grinds my gears because, you"},{"start":2050.079,"text":"what what grinds my gears because, you know, if you're a user from a certain"},{"start":2051.75,"text":"know, if you're a user from a certain"},{"start":2051.76,"text":"know, if you're a user from a certain community, you go like, \"Oh, well, I use"},{"start":2053.669,"text":"community, you go like, \"Oh, well, I use"},{"start":2053.679,"text":"community, you go like, \"Oh, well, I use cond for everything, so of course I'm"},{"start":2055.03,"text":"cond for everything, so of course I'm"},{"start":2055.04,"text":"cond for everything, so of course I'm going to use cond for MPF for pi.\" Now,"},{"start":2056.869,"text":"going to use cond for MPF for pi.\" Now,"},{"start":2056.879,"text":"going to use cond for MPF for pi.\" Now, this won't crash. It'll run. It'll give"},{"start":2059.99,"text":"this won't crash. It'll run. It'll give"},{"start":2060.0,"text":"this won't crash. It'll run. It'll give you like a million single rank jobs,"},{"start":2063.03,"text":"you like a million single rank jobs,"},{"start":2063.04,"text":"you like a million single rank jobs, right? So, so then you're kind of"},{"start":2064.71,"text":"right? So, so then you're kind of"},{"start":2064.72,"text":"right? So, so then you're kind of scratching your head like, why does my"},{"start":2066.069,"text":"scratching your head like, why does my"},{"start":2066.079,"text":"scratching your head like, why does my equation look funny? Um, and then"},{"start":2068.149,"text":"equation look funny? Um, and then"},{"start":2068.159,"text":"equation look funny? Um, and then eventually you get frustrated. you go to"},{"start":2069.829,"text":"eventually you get frustrated. you go to"},{"start":2069.839,"text":"eventually you get frustrated. you go to the documentation and you have to go"},{"start":2071.27,"text":"the documentation and you have to go"},{"start":2071.28,"text":"the documentation and you have to go like fairly deep and and then you see"},{"start":2073.349,"text":"like fairly deep and and then you see"},{"start":2073.359,"text":"like fairly deep and and then you see this box and then you go like why why"},{"start":2074.95,"text":"this box and then you go like why why"},{"start":2074.96,"text":"this box and then you go like why why the hasn't anyone told me this"},{"start":2076.23,"text":"the hasn't anyone told me this"},{"start":2076.24,"text":"the hasn't anyone told me this before? Uh and so that's the thing that"},{"start":2078.31,"text":"before? Uh and so that's the thing that"},{"start":2078.32,"text":"before? Uh and so that's the thing that I really really don't like. Uh and so"},{"start":2081.75,"text":"I really really don't like. Uh and so"},{"start":2081.76,"text":"I really really don't like. Uh and so that's to talk about the pref like to to"},{"start":2083.75,"text":"that's to talk about the pref like to to"},{"start":2083.76,"text":"that's to talk about the pref like to to talk about uh preferences if if other"},{"start":2086.95,"text":"talk about uh preferences if if other"},{"start":2086.96,"text":"talk about uh preferences if if other languages had this right like this"},{"start":2088.629,"text":"languages had this right like this"},{"start":2088.639,"text":"languages had this right like this horrible line right uh you have to say"},{"start":2090.629,"text":"horrible line right uh you have to say"},{"start":2090.639,"text":"horrible line right uh you have to say npicc equals yada yada yada right like"},{"start":2095.109,"text":"npicc equals yada yada yada right like"},{"start":2095.119,"text":"npicc equals yada yada yada right like Python if yeah I when I use Julia I find"},{"start":2097.75,"text":"Python if yeah I when I use Julia I find"},{"start":2097.76,"text":"Python if yeah I when I use Julia I find using the shell like dirty it's like"},{"start":2100.63,"text":"using the shell like dirty it's like"},{"start":2100.64,"text":"using the shell like dirty it's like this bash is a horrible language why do"},{"start":2102.55,"text":"this bash is a horrible language why do"},{"start":2102.56,"text":"this bash is a horrible language why do you make me use it um so yeah anyway"},{"start":2105.27,"text":"you make me use it um so yeah anyway"},{"start":2105.28,"text":"you make me use it um so yeah anyway this is sort of my soap box that like"},{"start":2107.43,"text":"this is sort of my soap box that like"},{"start":2107.44,"text":"this is sort of my soap box that like your language like there should be a"},{"start":2109.75,"text":"your language like there should be a"},{"start":2109.76,"text":"your language like there should be a standard"},{"start":2111.27,"text":"standard"},{"start":2111.28,"text":"standard for the environment"},{"start":2113.67,"text":"for the environment"},{"start":2113.68,"text":"for the environment like is it environment variables or"},{"start":2115.51,"text":"like is it environment variables or"},{"start":2115.52,"text":"like is it environment variables or something but there's a standard that"},{"start":2117.27,"text":"something but there's a standard that"},{"start":2117.28,"text":"something but there's a standard that every language knows where to look this"},{"start":2119.75,"text":"every language knows where to look this"},{"start":2119.76,"text":"every language knows where to look this is how I'm supposed to run"},{"start":2122.31,"text":"is how I'm supposed to run"},{"start":2122.32,"text":"is how I'm supposed to run uh or or maybe like sorry I can't be"},{"start":2125.91,"text":"uh or or maybe like sorry I can't be"},{"start":2125.92,"text":"uh or or maybe like sorry I can't be automatic so I'm going to crash and tell"},{"start":2127.829,"text":"automatic so I'm going to crash and tell"},{"start":2127.839,"text":"automatic so I'm going to crash and tell the user where to find the docs but"},{"start":2130.15,"text":"the user where to find the docs but"},{"start":2130.16,"text":"the user where to find the docs but don't don't just like require the user"},{"start":2132.71,"text":"don't don't just like require the user"},{"start":2132.72,"text":"don't don't just like require the user to have read the manual before doing"},{"start":2134.23,"text":"to have read the manual before doing"},{"start":2134.24,"text":"to have read the manual before doing anything"},{"start":2140.069,"text":"it's kind of funny also Sorry, one more"},{"start":2140.079,"text":"it's kind of funny also Sorry, one more soap box thing. Uh, people are now"},{"start":2142.23,"text":"soap box thing. Uh, people are now"},{"start":2142.24,"text":"soap box thing. Uh, people are now complaining that if you ask chat GPT how"},{"start":2144.95,"text":"complaining that if you ask chat GPT how"},{"start":2144.96,"text":"complaining that if you ask chat GPT how to install NPI4 PI on on a HPC system,"},{"start":2148.79,"text":"to install NPI4 PI on on a HPC system,"},{"start":2148.8,"text":"to install NPI4 PI on on a HPC system, like we've got the most documentation,"},{"start":2150.71,"text":"like we've got the most documentation,"},{"start":2150.72,"text":"like we've got the most documentation, so it tells us to that tells them to use"},{"start":2152.47,"text":"so it tells us to that tells them to use"},{"start":2152.48,"text":"so it tells us to that tells them to use the nurse documentation, which is great"},{"start":2153.99,"text":"the nurse documentation, which is great"},{"start":2154.0,"text":"the nurse documentation, which is great because if they're not at Nursek, they"},{"start":2155.829,"text":"because if they're not at Nursek, they"},{"start":2155.839,"text":"because if they're not at Nursek, they then it won't work."},{"start":2158.63,"text":"then it won't work."},{"start":2158.64,"text":"then it won't work. So anyway, I yield the floor."},{"start":2174.87,"text":"if you're you know you can ask us uh you"},{"start":2174.88,"text":"if you're you know you can ask us uh you can complain about things that don't"},{"start":2176.23,"text":"can complain about things that don't"},{"start":2176.24,"text":"can complain about things that don't work well. There's also things that"},{"start":2177.349,"text":"work well. There's also things that"},{"start":2177.359,"text":"work well. There's also things that don't work well. So you can yell at me"},{"start":2179.03,"text":"don't work well. So you can yell at me"},{"start":2179.04,"text":"don't work well. So you can yell at me to close a poll request something like"},{"start":2180.95,"text":"to close a poll request something like"},{"start":2180.96,"text":"to close a poll request something like that"},{"start":2193.91,"text":"for less joiners. This is the cure code"},{"start":2193.92,"text":"for less joiners. This is the cure code to access the document. Um, where we"},{"start":2196.55,"text":"to access the document. Um, where we"},{"start":2196.56,"text":"to access the document. Um, where we keep the notes"},{"start":2207.03,"text":"and and you can add things to to talk"},{"start":2207.04,"text":"and and you can add things to to talk about"},{"start":2209.109,"text":"about"},{"start":2209.119,"text":"about or raise your end and ask the questions."},{"start":2230.15,"text":"So regarding the matrix conversation for"},{"start":2230.16,"text":"So regarding the matrix conversation for NPI JL's earlier, we have a the League"},{"start":2234.47,"text":"NPI JL's earlier, we have a the League"},{"start":2234.48,"text":"NPI JL's earlier, we have a the League JLL runtime and part of it is basically"},{"start":2239.19,"text":"JLL runtime and part of it is basically"},{"start":2239.2,"text":"JLL runtime and part of it is basically I mean I I mentioned UCX. UCX is a"},{"start":2241.75,"text":"I mean I I mentioned UCX. UCX is a"},{"start":2241.76,"text":"I mean I I mentioned UCX. UCX is a configuration option to supply in the"},{"start":2243.67,"text":"configuration option to supply in the"},{"start":2243.68,"text":"configuration option to supply in the matrix and my approach was just build"},{"start":2247.43,"text":"matrix and my approach was just build"},{"start":2247.44,"text":"matrix and my approach was just build every possible combination. and there's"},{"start":2249.03,"text":"every possible combination. and there's"},{"start":2249.04,"text":"every possible combination. and there's not too many and to build UCX the only"},{"start":2253.19,"text":"not too many and to build UCX the only"},{"start":2253.2,"text":"not too many and to build UCX the only way we could do it is with open MPI but"},{"start":2255.03,"text":"way we could do it is with open MPI but"},{"start":2255.04,"text":"way we could do it is with open MPI but if the user has mpitch then we're out of"},{"start":2257.829,"text":"if the user has mpitch then we're out of"},{"start":2257.839,"text":"if the user has mpitch then we're out of luck. Um, should I continue the approach"},{"start":2261.67,"text":"luck. Um, should I continue the approach"},{"start":2261.68,"text":"luck. Um, should I continue the approach of trying to support I mean there"},{"start":2263.51,"text":"of trying to support I mean there"},{"start":2263.52,"text":"of trying to support I mean there there's not as many configurations as"},{"start":2266.069,"text":"there's not as many configurations as"},{"start":2266.079,"text":"there's not as many configurations as MPI, but there there's still like I"},{"start":2270.15,"text":"MPI, but there there's still like I"},{"start":2270.16,"text":"MPI, but there there's still like I don't know 4x4."},{"start":2272.79,"text":"don't know 4x4."},{"start":2272.8,"text":"don't know 4x4. You could you could expand like over 20"},{"start":2276.069,"text":"You could you could expand like over 20"},{"start":2276.079,"text":"You could you could expand like over 20 possible combinations or something like"},{"start":2278.71,"text":"possible combinations or something like"},{"start":2278.72,"text":"possible combinations or something like that. Should should I continue my"},{"start":2281.829,"text":"that. Should should I continue my"},{"start":2281.839,"text":"that. Should should I continue my approach of doing that or I don't"},{"start":2285.589,"text":"approach of doing that or I don't"},{"start":2285.599,"text":"approach of doing that or I don't I don't know."},{"start":2287.27,"text":"I don't know."},{"start":2287.28,"text":"I don't know. I have a followup question. Um, do you"},{"start":2290.069,"text":"I have a followup question. Um, do you"},{"start":2290.079,"text":"I have a followup question. Um, do you talk to UC It sounds like you're talking"},{"start":2291.43,"text":"talk to UC It sounds like you're talking"},{"start":2291.44,"text":"talk to UC It sounds like you're talking to UCX directly."},{"start":2293.99,"text":"to UCX directly."},{"start":2294.0,"text":"to UCX directly. Is is that right?"},{"start":2296.47,"text":"Is is that right?"},{"start":2296.48,"text":"Is is that right? &gt;&gt; Yeah. So, the Legate runtime could"},{"start":2299.349,"text":"&gt;&gt; Yeah. So, the Legate runtime could"},{"start":2299.359,"text":"&gt;&gt; Yeah. So, the Legate runtime could utilize it's agnostic to the"},{"start":2301.589,"text":"utilize it's agnostic to the"},{"start":2301.599,"text":"utilize it's agnostic to the communication layer. You could configure"},{"start":2303.75,"text":"communication layer. You could configure"},{"start":2303.76,"text":"communication layer. You could configure based on the communication layer. Um,"},{"start":2306.55,"text":"based on the communication layer. Um,"},{"start":2306.56,"text":"based on the communication layer. Um, and UCX is one of the configuration"},{"start":2308.71,"text":"and UCX is one of the configuration"},{"start":2308.72,"text":"and UCX is one of the configuration parameters. Um so the goal is if you"},{"start":2312.95,"text":"parameters. Um so the goal is if you"},{"start":2312.96,"text":"parameters. Um so the goal is if you configure with UCX you'll use UCX across"},{"start":2315.99,"text":"configure with UCX you'll use UCX across"},{"start":2316.0,"text":"configure with UCX you'll use UCX across your distributed node um cluster or you"},{"start":2319.67,"text":"your distributed node um cluster or you"},{"start":2319.68,"text":"your distributed node um cluster or you could use some other communication"},{"start":2321.27,"text":"could use some other communication"},{"start":2321.28,"text":"could use some other communication protocol"},{"start":2322.95,"text":"protocol"},{"start":2322.96,"text":"protocol like we also support nickel and some"},{"start":2325.51,"text":"like we also support nickel and some"},{"start":2325.52,"text":"like we also support nickel and some others."},{"start":2331.829,"text":"&gt;&gt; Another followup you are building a"},{"start":2331.839,"text":"&gt;&gt; Another followup you are building a package called legot.jl right?"},{"start":2336.069,"text":"package called legot.jl right?"},{"start":2336.079,"text":"package called legot.jl right? Yeah, we we have legate uh JL and"},{"start":2338.79,"text":"Yeah, we we have legate uh JL and"},{"start":2338.8,"text":"Yeah, we we have legate uh JL and there's also a JLL"},{"start":2341.589,"text":"there's also a JLL"},{"start":2341.599,"text":"there's also a JLL binary builder package that's based off"},{"start":2343.99,"text":"binary builder package that's based off"},{"start":2344.0,"text":"binary builder package that's based off the C++ runtime and we configure that"},{"start":2347.589,"text":"the C++ runtime and we configure that"},{"start":2347.599,"text":"the C++ runtime and we configure that and we link dynamically load to legateJL"},{"start":2351.589,"text":"and we link dynamically load to legateJL"},{"start":2351.599,"text":"and we link dynamically load to legateJL and then there's a Julia front end for"},{"start":2354.47,"text":"and then there's a Julia front end for"},{"start":2354.48,"text":"and then there's a Julia front end for that."},{"start":2367.43,"text":"&gt;&gt; Okay. So, so you you are you know each"},{"start":2367.44,"text":"&gt;&gt; Okay. So, so you you are you know each other, you're gonna talk, right?"},{"start":2370.15,"text":"other, you're gonna talk, right?"},{"start":2370.16,"text":"other, you're gonna talk, right? &gt;&gt; Okay."},{"start":2371.91,"text":"&gt;&gt; Okay."},{"start":2371.92,"text":"&gt;&gt; Okay. &gt;&gt; Yes."},{"start":2372.95,"text":"&gt;&gt; Yes."},{"start":2372.96,"text":"&gt;&gt; Yes. &gt;&gt; The Davids will talk. Um, also for the"},{"start":2375.99,"text":"&gt;&gt; The Davids will talk. Um, also for the"},{"start":2376.0,"text":"&gt;&gt; The Davids will talk. Um, also for the record, um, I think what's happened"},{"start":2379.43,"text":"record, um, I think what's happened"},{"start":2379.44,"text":"record, um, I think what's happened is a little bit of a confusion."},{"start":2383.829,"text":"is a little bit of a confusion."},{"start":2383.839,"text":"is a little bit of a confusion. I know. Do you know Elliot Slaughter at"},{"start":2386.95,"text":"I know. Do you know Elliot Slaughter at"},{"start":2386.96,"text":"I know. Do you know Elliot Slaughter at Slack? Yes. So, I I've been working with"},{"start":2389.51,"text":"Slack? Yes. So, I I've been working with"},{"start":2389.52,"text":"Slack? Yes. So, I I've been working with Elliott uh on the non Julia side of"},{"start":2393.03,"text":"Elliott uh on the non Julia side of"},{"start":2393.04,"text":"Elliott uh on the non Julia side of these things. Um"},{"start":2395.99,"text":"these things. Um"},{"start":2396.0,"text":"these things. Um and I my recommendation would be for you"},{"start":2399.51,"text":"and I my recommendation would be for you"},{"start":2399.52,"text":"and I my recommendation would be for you to use preferences to um skip the whole"},{"start":2402.95,"text":"to use preferences to um skip the whole"},{"start":2402.96,"text":"to use preferences to um skip the whole NPI business, right? Like NPI is one"},{"start":2405.91,"text":"NPI business, right? Like NPI is one"},{"start":2405.92,"text":"NPI business, right? Like NPI is one transport layer and and it's like don't"},{"start":2408.87,"text":"transport layer and and it's like don't"},{"start":2408.88,"text":"transport layer and and it's like don't don't worry how it's configured. Uh it's"},{"start":2411.829,"text":"don't worry how it's configured. Uh it's"},{"start":2411.839,"text":"don't worry how it's configured. Uh it's like MP the NPI transport layer is what"},{"start":2413.99,"text":"like MP the NPI transport layer is what"},{"start":2414.0,"text":"like MP the NPI transport layer is what you use if your HPC center admin says I"},{"start":2417.109,"text":"you use if your HPC center admin says I"},{"start":2417.119,"text":"you use if your HPC center admin says I can't be asked to help you configure"},{"start":2419.03,"text":"can't be asked to help you configure"},{"start":2419.04,"text":"can't be asked to help you configure UCX. So I'm going to insist that you use"},{"start":2423.19,"text":"UCX. So I'm going to insist that you use"},{"start":2423.2,"text":"UCX. So I'm going to insist that you use um"},{"start":2423.99,"text":"um"},{"start":2424.0,"text":"um uh you know MPI um there's another name"},{"start":2426.47,"text":"uh you know MPI um there's another name"},{"start":2426.48,"text":"uh you know MPI um there's another name for those they're cray admins um sorry"},{"start":2429.75,"text":"for those they're cray admins um sorry"},{"start":2429.76,"text":"for those they're cray admins um sorry I'm one of them so I'm allowed to mock"},{"start":2431.75,"text":"I'm one of them so I'm allowed to mock"},{"start":2431.76,"text":"I'm one of them so I'm allowed to mock them uh anyway um so so yeah you should"},{"start":2435.91,"text":"them uh anyway um so so yeah you should"},{"start":2435.92,"text":"them uh anyway um so so yeah you should have use in in legatojl preferences uh"},{"start":2439.589,"text":"have use in in legatojl preferences uh"},{"start":2439.599,"text":"have use in in legatojl preferences uh to let the system like to let global"},{"start":2442.15,"text":"to let the system like to let global"},{"start":2442.16,"text":"to let the system like to let global preferences tell you uh what the back"},{"start":2445.43,"text":"preferences tell you uh what the back"},{"start":2445.44,"text":"preferences tell you uh what the back end is of the back end of preference is"},{"start":2448.39,"text":"end is of the back end of preference is"},{"start":2448.4,"text":"end is of the back end of preference is so"},{"start":2454.47,"text":"&gt;&gt; thanks I had a general General question"},{"start":2454.48,"text":"&gt;&gt; thanks I had a general General question for the audience of"},{"start":2457.829,"text":"for the audience of"},{"start":2457.839,"text":"for the audience of what people think is the main impediment"},{"start":2460.79,"text":"what people think is the main impediment"},{"start":2460.8,"text":"what people think is the main impediment to greater Julia use in HPC or the NA or"},{"start":2465.51,"text":"to greater Julia use in HPC or the NA or"},{"start":2465.52,"text":"to greater Julia use in HPC or the NA or supercomputers in the national labs. Is"},{"start":2467.91,"text":"supercomputers in the national labs. Is"},{"start":2467.92,"text":"supercomputers in the national labs. Is this as we were actually discussing a"},{"start":2470.47,"text":"this as we were actually discussing a"},{"start":2470.48,"text":"this as we were actually discussing a few other times, I mean at the uh the"},{"start":2473.75,"text":"few other times, I mean at the uh the"},{"start":2473.76,"text":"few other times, I mean at the uh the keynote this morning, the issue with the"},{"start":2476.55,"text":"keynote this morning, the issue with the"},{"start":2476.56,"text":"keynote this morning, the issue with the ability to support"},{"start":2479.03,"text":"ability to support"},{"start":2479.04,"text":"ability to support GPUs and some of the distributed"},{"start":2481.349,"text":"GPUs and some of the distributed"},{"start":2481.359,"text":"GPUs and some of the distributed memories,"},{"start":2483.109,"text":"memories,"},{"start":2483.119,"text":"memories, foreign memory issues with Julie, is it"},{"start":2485.27,"text":"foreign memory issues with Julie, is it"},{"start":2485.28,"text":"foreign memory issues with Julie, is it a technical issue? In other words, do"},{"start":2487.589,"text":"a technical issue? In other words, do"},{"start":2487.599,"text":"a technical issue? In other words, do you think the do people hear the"},{"start":2489.27,"text":"you think the do people hear the"},{"start":2489.28,"text":"you think the do people hear the consensus for this self- selected crowd"},{"start":2491.67,"text":"consensus for this self- selected crowd"},{"start":2491.68,"text":"consensus for this self- selected crowd that an improved implementation"},{"start":2495.109,"text":"that an improved implementation"},{"start":2495.119,"text":"that an improved implementation of the technology of that support for"},{"start":2498.87,"text":"of the technology of that support for"},{"start":2498.88,"text":"of the technology of that support for GPUs or packages would increase the"},{"start":2502.39,"text":"GPUs or packages would increase the"},{"start":2502.4,"text":"GPUs or packages would increase the usage or is this more an education where"},{"start":2505.51,"text":"usage or is this more an education where"},{"start":2505.52,"text":"usage or is this more an education where people need um you know cookbook recipes"},{"start":2509.43,"text":"people need um you know cookbook recipes"},{"start":2509.44,"text":"people need um you know cookbook recipes you know Stack Overflow I mean general"},{"start":2511.51,"text":"you know Stack Overflow I mean general"},{"start":2511.52,"text":"you know Stack Overflow I mean general solutions Julia for their specific"},{"start":2514.069,"text":"solutions Julia for their specific"},{"start":2514.079,"text":"solutions Julia for their specific problem or is it an ISS issue of having"},{"start":2518.55,"text":"problem or is it an ISS issue of having"},{"start":2518.56,"text":"problem or is it an ISS issue of having Julia being more infused in the basic"},{"start":2521.19,"text":"Julia being more infused in the basic"},{"start":2521.2,"text":"Julia being more infused in the basic education at the undergraduate level. So"},{"start":2523.43,"text":"education at the undergraduate level. So"},{"start":2523.44,"text":"education at the undergraduate level. So like do people is there any consensus of"},{"start":2525.43,"text":"like do people is there any consensus of"},{"start":2525.44,"text":"like do people is there any consensus of what's I mean obviously all three would"},{"start":2527.99,"text":"what's I mean obviously all three would"},{"start":2528.0,"text":"what's I mean obviously all three would help but is there any sense of what is"},{"start":2531.51,"text":"help but is there any sense of what is"},{"start":2531.52,"text":"help but is there any sense of what is the major impediment to greater adoption"},{"start":2534.95,"text":"the major impediment to greater adoption"},{"start":2534.96,"text":"the major impediment to greater adoption at the national labs?"},{"start":2543.99,"text":"I want to expand this beyond the"},{"start":2544.0,"text":"I want to expand this beyond the national labs but um like U if if you're"},{"start":2547.75,"text":"national labs but um like U if if you're"},{"start":2547.76,"text":"national labs but um like U if if you're asking about the national labs"},{"start":2550.95,"text":"asking about the national labs"},{"start":2550.96,"text":"asking about the national labs um"},{"start":2553.27,"text":"um"},{"start":2553.28,"text":"um I think language adoption"},{"start":2557.19,"text":"I think language adoption"},{"start":2557.2,"text":"I think language adoption is often driven so national lab context"},{"start":2561.109,"text":"is often driven so national lab context"},{"start":2561.119,"text":"is often driven so national lab context is missiondriven research so it means um"},{"start":2565.43,"text":"is missiondriven research so it means um"},{"start":2565.44,"text":"is missiondriven research so it means um our funer which is predominantly a"},{"start":2568.63,"text":"our funer which is predominantly a"},{"start":2568.64,"text":"our funer which is predominantly a taxpayer gives us um a list of"},{"start":2571.99,"text":"taxpayer gives us um a list of"},{"start":2572.0,"text":"taxpayer gives us um a list of priorities we should work on um a really"},{"start":2575.51,"text":"priorities we should work on um a really"},{"start":2575.52,"text":"priorities we should work on um a really A nice example of that was um you know"},{"start":2577.829,"text":"A nice example of that was um you know"},{"start":2577.839,"text":"A nice example of that was um you know almost about 10 years ago um they said"},{"start":2580.79,"text":"almost about 10 years ago um they said"},{"start":2580.8,"text":"almost about 10 years ago um they said well we want to build an exoscale"},{"start":2582.069,"text":"well we want to build an exoscale"},{"start":2582.079,"text":"well we want to build an exoscale machine uh and so um your job is to"},{"start":2586.55,"text":"machine uh and so um your job is to"},{"start":2586.56,"text":"machine uh and so um your job is to build applications that are just"},{"start":2588.71,"text":"build applications that are just"},{"start":2588.72,"text":"build applications that are just ginormous to to use these exoscale"},{"start":2591.67,"text":"ginormous to to use these exoscale"},{"start":2591.68,"text":"ginormous to to use these exoscale machines and then they would give us a"},{"start":2593.109,"text":"machines and then they would give us a"},{"start":2593.119,"text":"machines and then they would give us a bunch of money for that. Um and the"},{"start":2596.15,"text":"bunch of money for that. Um and the"},{"start":2596.16,"text":"bunch of money for that. Um and the consequence of"},{"start":2605.03,"text":"so so what what that means is often you"},{"start":2605.04,"text":"so so what what that means is often you look in your tool chest what gets us"},{"start":2607.51,"text":"look in your tool chest what gets us"},{"start":2607.52,"text":"look in your tool chest what gets us halfway there. Um because that's the"},{"start":2610.309,"text":"halfway there. Um because that's the"},{"start":2610.319,"text":"halfway there. Um because that's the efficient use of money. Uh whenever you"},{"start":2613.349,"text":"efficient use of money. Uh whenever you"},{"start":2613.359,"text":"efficient use of money. Uh whenever you rebuild something from scratch it's sort"},{"start":2615.109,"text":"rebuild something from scratch it's sort"},{"start":2615.119,"text":"rebuild something from scratch it's sort of met with raised eyebrows. It's like"},{"start":2617.349,"text":"of met with raised eyebrows. It's like"},{"start":2617.359,"text":"of met with raised eyebrows. It's like why didn't the current existing um uh"},{"start":2620.95,"text":"why didn't the current existing um uh"},{"start":2620.96,"text":"why didn't the current existing um uh stuff work? Um and And"},{"start":2625.67,"text":"stuff work? Um and And"},{"start":2625.68,"text":"stuff work? Um and And um"},{"start":2627.589,"text":"um"},{"start":2627.599,"text":"um at that point I think the the the things"},{"start":2630.23,"text":"at that point I think the the the things"},{"start":2630.24,"text":"at that point I think the the the things that we can do as a as a community is um"},{"start":2633.51,"text":"that we can do as a as a community is um"},{"start":2633.52,"text":"that we can do as a as a community is um the social aspect I think is advocating"},{"start":2635.349,"text":"the social aspect I think is advocating"},{"start":2635.359,"text":"the social aspect I think is advocating for why is this necessary to rewrite"},{"start":2637.19,"text":"for why is this necessary to rewrite"},{"start":2637.2,"text":"for why is this necessary to rewrite this forrron application in Julia now or"},{"start":2639.91,"text":"this forrron application in Julia now or"},{"start":2639.92,"text":"this forrron application in Julia now or or the C++ application or this Python"},{"start":2642.15,"text":"or the C++ application or this Python"},{"start":2642.16,"text":"or the C++ application or this Python application right um"},{"start":2645.27,"text":"application right um"},{"start":2645.28,"text":"application right um I'm also thinking uh"},{"start":2654.47,"text":"so so that that that's a social side and"},{"start":2654.48,"text":"so so that that that's a social side and I think then the engineering side is um"},{"start":2657.03,"text":"I think then the engineering side is um"},{"start":2657.04,"text":"I think then the engineering side is um how do we enable interoperability"},{"start":2659.19,"text":"how do we enable interoperability"},{"start":2659.2,"text":"how do we enable interoperability because like my personal preference here"},{"start":2661.99,"text":"because like my personal preference here"},{"start":2662.0,"text":"because like my personal preference here or my personal u like theory here is"},{"start":2665.349,"text":"or my personal u like theory here is"},{"start":2665.359,"text":"or my personal u like theory here is rewriting uh an uh your code in a"},{"start":2668.309,"text":"rewriting uh an uh your code in a"},{"start":2668.319,"text":"rewriting uh an uh your code in a language to match what the vendor can"},{"start":2669.91,"text":"language to match what the vendor can"},{"start":2669.92,"text":"language to match what the vendor can deliver in terms of performance is a"},{"start":2672.63,"text":"deliver in terms of performance is a"},{"start":2672.64,"text":"deliver in terms of performance is a terrible terrible waste of effort right"},{"start":2675.51,"text":"terrible terrible waste of effort right"},{"start":2675.52,"text":"terrible terrible waste of effort right um you every time you're rewriting code"},{"start":2677.75,"text":"um you every time you're rewriting code"},{"start":2677.76,"text":"um you every time you're rewriting code you're not building u you're not doing"},{"start":2679.51,"text":"you're not building u you're not doing"},{"start":2679.52,"text":"you're not building u you're not doing new research"},{"start":2681.27,"text":"new research"},{"start":2681.28,"text":"new research um so a language rewrite It should be"},{"start":2684.069,"text":"um so a language rewrite It should be"},{"start":2684.079,"text":"um so a language rewrite It should be driven by the fact that you look at one"},{"start":2685.91,"text":"driven by the fact that you look at one"},{"start":2685.92,"text":"driven by the fact that you look at one language and you go like heck I can't"},{"start":2687.99,"text":"language and you go like heck I can't"},{"start":2688.0,"text":"language and you go like heck I can't express my thoughts in this language but"},{"start":2689.67,"text":"express my thoughts in this language but"},{"start":2689.68,"text":"express my thoughts in this language but in this other language I can. That's I"},{"start":2692.47,"text":"in this other language I can. That's I"},{"start":2692.48,"text":"in this other language I can. That's I think the only acceptable time you"},{"start":2694.55,"text":"think the only acceptable time you"},{"start":2694.56,"text":"think the only acceptable time you you're going to do that. Um but too"},{"start":2697.19,"text":"you're going to do that. Um but too"},{"start":2697.2,"text":"you're going to do that. Um but too often do we go oh we need to do AI now."},{"start":2700.15,"text":"often do we go oh we need to do AI now."},{"start":2700.16,"text":"often do we go oh we need to do AI now. That's really a thing that the funders"},{"start":2702.63,"text":"That's really a thing that the funders"},{"start":2702.64,"text":"That's really a thing that the funders are saying here's a billion dollars"},{"start":2705.829,"text":"are saying here's a billion dollars"},{"start":2705.839,"text":"are saying here's a billion dollars make AI better."},{"start":2708.39,"text":"make AI better."},{"start":2708.4,"text":"make AI better. And um I'm in many conversation where"},{"start":2711.27,"text":"And um I'm in many conversation where"},{"start":2711.28,"text":"And um I'm in many conversation where the the room says I hate using Python."},{"start":2715.27,"text":"the the room says I hate using Python."},{"start":2715.28,"text":"the the room says I hate using Python. It's a weird language. Why does why is"},{"start":2717.109,"text":"It's a weird language. Why does why is"},{"start":2717.119,"text":"It's a weird language. Why does why is indent? You know, Bob here uses two"},{"start":2719.03,"text":"indent? You know, Bob here uses two"},{"start":2719.04,"text":"indent? You know, Bob here uses two spaces to indent in indent. Jean here"},{"start":2721.91,"text":"spaces to indent in indent. Jean here"},{"start":2721.92,"text":"spaces to indent in indent. Jean here uses tabs. Johannes uses eight spaces."},{"start":2726.23,"text":"uses tabs. Johannes uses eight spaces."},{"start":2726.24,"text":"uses tabs. Johannes uses eight spaces. Uh we can't even exchange code. Um"},{"start":2730.55,"text":"Uh we can't even exchange code. Um"},{"start":2730.56,"text":"Uh we can't even exchange code. Um anyway, uh and so I think uh in that and"},{"start":2733.91,"text":"anyway, uh and so I think uh in that and"},{"start":2733.92,"text":"anyway, uh and so I think uh in that and and then I would be like, \"Hey, Julia"},{"start":2735.75,"text":"and then I would be like, \"Hey, Julia"},{"start":2735.76,"text":"and then I would be like, \"Hey, Julia works great.\" and they say yeah but I"},{"start":2737.19,"text":"works great.\" and they say yeah but I"},{"start":2737.2,"text":"works great.\" and they say yeah but I can't call my my existing tool chains"},{"start":2739.75,"text":"can't call my my existing tool chains"},{"start":2739.76,"text":"can't call my my existing tool chains from from within there and so"},{"start":2742.39,"text":"from from within there and so"},{"start":2742.4,"text":"from from within there and so long rambling answer for"},{"start":2743.589,"text":"long rambling answer for"},{"start":2743.599,"text":"long rambling answer for interoperability I think is the"},{"start":2744.87,"text":"interoperability I think is the"},{"start":2744.88,"text":"interoperability I think is the important thing there"},{"start":2747.349,"text":"important thing there"},{"start":2747.359,"text":"important thing there but I would broaden it I would say like"},{"start":2749.829,"text":"but I would broaden it I would say like"},{"start":2749.839,"text":"but I would broaden it I would say like anyone here should be willing to"},{"start":2751.349,"text":"anyone here should be willing to"},{"start":2751.359,"text":"anyone here should be willing to disagree with me please I'm also saying"},{"start":2753.75,"text":"disagree with me please I'm also saying"},{"start":2753.76,"text":"disagree with me please I'm also saying controversial things for people to"},{"start":2755.27,"text":"controversial things for people to"},{"start":2755.28,"text":"controversial things for people to disagree with me and it doesn't have to"},{"start":2757.19,"text":"disagree with me and it doesn't have to"},{"start":2757.2,"text":"disagree with me and it doesn't have to be DOE"},{"start":2759.589,"text":"be DOE"},{"start":2759.599,"text":"be DOE so"},{"start":2761.27,"text":"so"},{"start":2761.28,"text":"so so you can agree with me that's lovely"},{"start":2770.87,"text":"No one disagrees. Come on."},{"start":2770.88,"text":"No one disagrees. Come on. All right, I'll say something really"},{"start":2772.39,"text":"All right, I'll say something really"},{"start":2772.4,"text":"All right, I'll say something really really."},{"start":2775.109,"text":"really."},{"start":2775.119,"text":"really. You're saving me from saying"},{"start":2776.15,"text":"You're saving me from saying"},{"start":2776.16,"text":"You're saving me from saying controversial things. Thank you."},{"start":2777.91,"text":"controversial things. Thank you."},{"start":2777.92,"text":"controversial things. Thank you. &gt;&gt; You can say controversial things later."},{"start":2781.51,"text":"&gt;&gt; You can say controversial things later."},{"start":2781.52,"text":"&gt;&gt; You can say controversial things later. I'll get I just I give you"},{"start":2784.39,"text":"I'll get I just I give you"},{"start":2784.4,"text":"I'll get I just I give you a perspective that um I think the you"},{"start":2788.63,"text":"a perspective that um I think the you"},{"start":2788.64,"text":"a perspective that um I think the you get"},{"start":2791.19,"text":"get"},{"start":2791.2,"text":"get I mean I think the point that Bob was"},{"start":2793.109,"text":"I mean I think the point that Bob was"},{"start":2793.119,"text":"I mean I think the point that Bob was making is you really need a real selling"},{"start":2795.27,"text":"making is you really need a real selling"},{"start":2795.28,"text":"making is you really need a real selling point for people to make a a a jump from"},{"start":2802.23,"text":"point for people to make a a a jump from"},{"start":2802.24,"text":"point for people to make a a a jump from one system that they're using to another"},{"start":2804.23,"text":"one system that they're using to another"},{"start":2804.24,"text":"one system that they're using to another and different motivations appeal to"},{"start":2806.87,"text":"and different motivations appeal to"},{"start":2806.88,"text":"and different motivations appeal to different people. I think what we're"},{"start":2808.95,"text":"different people. I think what we're"},{"start":2808.96,"text":"different people. I think what we're trying to do in high energy physics is"},{"start":2811.19,"text":"trying to do in high energy physics is"},{"start":2811.2,"text":"trying to do in high energy physics is um like tap in at the graduate level"},{"start":2814.79,"text":"um like tap in at the graduate level"},{"start":2814.8,"text":"um like tap in at the graduate level actually and run more because there are"},{"start":2817.03,"text":"actually and run more because there are"},{"start":2817.04,"text":"actually and run more because there are various schools which are run for"},{"start":2819.109,"text":"various schools which are run for"},{"start":2819.119,"text":"various schools which are run for computing lots of them of course um"},{"start":2822.55,"text":"computing lots of them of course um"},{"start":2822.56,"text":"computing lots of them of course um concentrate on like high performance C++"},{"start":2825.03,"text":"concentrate on like high performance C++"},{"start":2825.04,"text":"concentrate on like high performance C++ now we're trying to push Julia in there"},{"start":2827.75,"text":"now we're trying to push Julia in there"},{"start":2827.76,"text":"now we're trying to push Julia in there as well as an alternative and what we've"},{"start":2830.39,"text":"as well as an alternative and what we've"},{"start":2830.4,"text":"as well as an alternative and what we've seen is that when people are exposed to"},{"start":2832.87,"text":"seen is that when people are exposed to"},{"start":2832.88,"text":"seen is that when people are exposed to both of these things Julia starts to"},{"start":2835.99,"text":"both of these things Julia starts to"},{"start":2836.0,"text":"both of these things Julia starts to seem like quite an attractive option"},{"start":2838.47,"text":"seem like quite an attractive option"},{"start":2838.48,"text":"seem like quite an attractive option And the other place where we're putting"},{"start":2841.829,"text":"And the other place where we're putting"},{"start":2841.839,"text":"And the other place where we're putting effort in amongst sort of small but"},{"start":2844.95,"text":"effort in amongst sort of small but"},{"start":2844.96,"text":"effort in amongst sort of small but committed group of enthusiasts is in"},{"start":2847.51,"text":"committed group of enthusiasts is in"},{"start":2847.52,"text":"committed group of enthusiasts is in shims. So making it easy for people to"},{"start":2851.03,"text":"shims. So making it easy for people to"},{"start":2851.04,"text":"shims. So making it easy for people to interface with existing codes which they"},{"start":2853.109,"text":"interface with existing codes which they"},{"start":2853.119,"text":"interface with existing codes which they have to use because there's this four"},{"start":2855.43,"text":"have to use because there's this four"},{"start":2855.44,"text":"have to use because there's this four million line code that's written in C++."},{"start":2858.71,"text":"million line code that's written in C++."},{"start":2858.72,"text":"million line code that's written in C++. No one is going to rewrite that tomorrow"},{"start":2860.71,"text":"No one is going to rewrite that tomorrow"},{"start":2860.72,"text":"No one is going to rewrite that tomorrow in Julia. So if I want to do take the"},{"start":2864.63,"text":"in Julia. So if I want to do take the"},{"start":2864.64,"text":"in Julia. So if I want to do take the output of that into Julia and do some"},{"start":2866.87,"text":"output of that into Julia and do some"},{"start":2866.88,"text":"output of that into Julia and do some more stuff with it, then I'll try and"},{"start":2869.109,"text":"more stuff with it, then I'll try and"},{"start":2869.119,"text":"more stuff with it, then I'll try and make sure that you can call it very"},{"start":2870.71,"text":"make sure that you can call it very"},{"start":2870.72,"text":"make sure that you can call it very easily from the from the Julia site. I"},{"start":2873.829,"text":"easily from the from the Julia site. I"},{"start":2873.839,"text":"easily from the from the Julia site. I guess it's a bit easier in the kind of"},{"start":2875.43,"text":"guess it's a bit easier in the kind of"},{"start":2875.44,"text":"guess it's a bit easier in the kind of serial processing world to do that"},{"start":2877.75,"text":"serial processing world to do that"},{"start":2877.76,"text":"serial processing world to do that because we don't have to worry about a"},{"start":2879.43,"text":"because we don't have to worry about a"},{"start":2879.44,"text":"because we don't have to worry about a lot of the things that you need to worry"},{"start":2881.19,"text":"lot of the things that you need to worry"},{"start":2881.2,"text":"lot of the things that you need to worry about in HPC. So um you know things like"},{"start":2884.47,"text":"about in HPC. So um you know things like"},{"start":2884.48,"text":"about in HPC. So um you know things like providing the the website with lots of"},{"start":2886.95,"text":"providing the the website with lots of"},{"start":2886.96,"text":"providing the the website with lots of hints and tips um is important and then"},{"start":2890.23,"text":"hints and tips um is important and then"},{"start":2890.24,"text":"hints and tips um is important and then supporting people if they are prepared"},{"start":2892.15,"text":"supporting people if they are prepared"},{"start":2892.16,"text":"supporting people if they are prepared to you know put some effort into trying"},{"start":2894.63,"text":"to you know put some effort into trying"},{"start":2894.64,"text":"to you know put some effort into trying out alternative solutions is good"},{"start":2896.95,"text":"out alternative solutions is good"},{"start":2896.96,"text":"out alternative solutions is good because you know honestly it's not like"},{"start":2901.03,"text":"because you know honestly it's not like"},{"start":2901.04,"text":"because you know honestly it's not like people have that easy a time of things"},{"start":2902.87,"text":"people have that easy a time of things"},{"start":2902.88,"text":"people have that easy a time of things if they go for Python or C++ they just"},{"start":2905.829,"text":"if they go for Python or C++ they just"},{"start":2905.839,"text":"if they go for Python or C++ they just run into different problems. So, you"},{"start":2908.71,"text":"run into different problems. So, you"},{"start":2908.72,"text":"run into different problems. So, you know, building a supportive community is"},{"start":2910.71,"text":"know, building a supportive community is"},{"start":2910.72,"text":"know, building a supportive community is also, I think, one of the sociologically"},{"start":2913.67,"text":"also, I think, one of the sociologically"},{"start":2913.68,"text":"also, I think, one of the sociologically important things to do and making it"},{"start":2916.23,"text":"important things to do and making it"},{"start":2916.24,"text":"important things to do and making it easy for people to get help as well. Um,"},{"start":2919.75,"text":"easy for people to get help as well. Um,"},{"start":2919.76,"text":"easy for people to get help as well. Um, but yeah, it's quite hard because I"},{"start":2923.43,"text":"but yeah, it's quite hard because I"},{"start":2923.44,"text":"but yeah, it's quite hard because I guess in the HPC world, C++ is kind of"},{"start":2926.71,"text":"guess in the HPC world, C++ is kind of"},{"start":2926.72,"text":"guess in the HPC world, C++ is kind of dominant. In the wider world, Python is"},{"start":2929.589,"text":"dominant. In the wider world, Python is"},{"start":2929.599,"text":"dominant. In the wider world, Python is the 600 pound gorilla that we're all"},{"start":2932.069,"text":"the 600 pound gorilla that we're all"},{"start":2932.079,"text":"the 600 pound gorilla that we're all trying to tackle. Um,"},{"start":2935.589,"text":"trying to tackle. Um,"},{"start":2935.599,"text":"trying to tackle. Um, yeah, that's that's what I'm going to"},{"start":2937.03,"text":"yeah, that's that's what I'm going to"},{"start":2937.04,"text":"yeah, that's that's what I'm going to say. Now, please say something more"},{"start":2939.589,"text":"say. Now, please say something more"},{"start":2939.599,"text":"say. Now, please say something more controversial than that."},{"start":2947.349,"text":"&gt;&gt; Yeah, mine is just an question about the"},{"start":2947.359,"text":"&gt;&gt; Yeah, mine is just an question about the community as well. What's the entry"},{"start":2949.589,"text":"community as well. What's the entry"},{"start":2949.599,"text":"community as well. What's the entry points for Julia and the HPC? Is it a"},{"start":2953.27,"text":"points for Julia and the HPC? Is it a"},{"start":2953.28,"text":"points for Julia and the HPC? Is it a graduate level or it's below the"},{"start":2955.109,"text":"graduate level or it's below the"},{"start":2955.119,"text":"graduate level or it's below the graduate level? That also helps to grow"},{"start":2957.829,"text":"graduate level? That also helps to grow"},{"start":2957.839,"text":"graduate level? That also helps to grow the community to know the entry"},{"start":2961.75,"text":"the community to know the entry"},{"start":2961.76,"text":"the community to know the entry point to Julia."},{"start":2970.23,"text":"I mean depends"},{"start":2970.24,"text":"I mean depends on on the opportunities that one has"},{"start":2972.309,"text":"on on the opportunities that one has"},{"start":2972.319,"text":"on on the opportunities that one has because like if someone is introduced to"},{"start":2974.15,"text":"because like if someone is introduced to"},{"start":2974.16,"text":"because like if someone is introduced to Julia in undergrad courses"},{"start":2977.67,"text":"Julia in undergrad courses"},{"start":2977.68,"text":"Julia in undergrad courses uh like I wish there were more undergrad"},{"start":2980.47,"text":"uh like I wish there were more undergrad"},{"start":2980.48,"text":"uh like I wish there were more undergrad courses where people will introduce but"},{"start":2982.63,"text":"courses where people will introduce but"},{"start":2982.64,"text":"courses where people will introduce but I don't think they're super super super"},{"start":2984.95,"text":"I don't think they're super super super"},{"start":2984.96,"text":"I don't think they're super super super common."},{"start":2989.99,"text":"I think part of the answer is you know"},{"start":2990.0,"text":"I think part of the answer is you know what whether you mean the theoretical"},{"start":2991.829,"text":"what whether you mean the theoretical"},{"start":2991.839,"text":"what whether you mean the theoretical entry point or what's the practical"},{"start":2993.43,"text":"entry point or what's the practical"},{"start":2993.44,"text":"entry point or what's the practical entry point now I theoretically Julia"},{"start":2997.75,"text":"entry point now I theoretically Julia"},{"start":2997.76,"text":"entry point now I theoretically Julia can be an introductory language as much"},{"start":3000.069,"text":"can be an introductory language as much"},{"start":3000.079,"text":"can be an introductory language as much as Python or C or C++ or anything else"},{"start":3003.91,"text":"as Python or C or C++ or anything else"},{"start":3003.92,"text":"as Python or C or C++ or anything else and it's a matter of instilling that"},{"start":3006.39,"text":"and it's a matter of instilling that"},{"start":3006.4,"text":"and it's a matter of instilling that into the curriculum and having that be"},{"start":3010.309,"text":"into the curriculum and having that be"},{"start":3010.319,"text":"into the curriculum and having that be more accessible. Um I mean right now it"},{"start":3014.47,"text":"more accessible. Um I mean right now it"},{"start":3014.48,"text":"more accessible. Um I mean right now it seems to be the second or third language"},{"start":3016.87,"text":"seems to be the second or third language"},{"start":3016.88,"text":"seems to be the second or third language for people who need a particular uh who"},{"start":3020.309,"text":"for people who need a particular uh who"},{"start":3020.319,"text":"for people who need a particular uh who find it more uh better able to express"},{"start":3024.79,"text":"find it more uh better able to express"},{"start":3024.8,"text":"find it more uh better able to express the"},{"start":3026.95,"text":"the"},{"start":3026.96,"text":"the uh the or describe the problems to"},{"start":3029.27,"text":"uh the or describe the problems to"},{"start":3029.28,"text":"uh the or describe the problems to implement the solutions. Um so it's"},{"start":3032.39,"text":"implement the solutions. Um so it's"},{"start":3032.4,"text":"implement the solutions. Um so it's people are gravitating to it from from"},{"start":3034.63,"text":"people are gravitating to it from from"},{"start":3034.64,"text":"people are gravitating to it from from and I'm not a you know deep member of"},{"start":3036.549,"text":"and I'm not a you know deep member of"},{"start":3036.559,"text":"and I'm not a you know deep member of the Julie community but gravitating it"},{"start":3038.47,"text":"the Julie community but gravitating it"},{"start":3038.48,"text":"the Julie community but gravitating it more when they um curiosity or that they"},{"start":3043.589,"text":"more when they um curiosity or that they"},{"start":3043.599,"text":"more when they um curiosity or that they you know through a colleague through"},{"start":3046.87,"text":"you know through a colleague through"},{"start":3046.88,"text":"you know through a colleague through that the team department is using it"},{"start":3049.349,"text":"that the team department is using it"},{"start":3049.359,"text":"that the team department is using it through that uh they encounter as people"},{"start":3052.309,"text":"through that uh they encounter as people"},{"start":3052.319,"text":"through that uh they encounter as people discussing the challenges with some of"},{"start":3054.309,"text":"discussing the challenges with some of"},{"start":3054.319,"text":"discussing the challenges with some of the other languages and find Julia more"},{"start":3056.309,"text":"the other languages and find Julia more"},{"start":3056.319,"text":"the other languages and find Julia more conducive to solving it. But I"},{"start":3059.43,"text":"conducive to solving it. But I"},{"start":3059.44,"text":"conducive to solving it. But I personally believe that"},{"start":3062.23,"text":"personally believe that"},{"start":3062.24,"text":"personally believe that injecting Julia earlier into the"},{"start":3067.51,"text":"injecting Julia earlier into the"},{"start":3067.52,"text":"injecting Julia earlier into the computational engineering computational"},{"start":3069.51,"text":"computational engineering computational"},{"start":3069.52,"text":"computational engineering computational science uh curriculum is important so"},{"start":3073.51,"text":"science uh curriculum is important so"},{"start":3073.52,"text":"science uh curriculum is important so that it becomes more pervasive as just a"},{"start":3076.71,"text":"that it becomes more pervasive as just a"},{"start":3076.72,"text":"that it becomes more pervasive as just a tool in people's tool belts to use as"},{"start":3079.349,"text":"tool in people's tool belts to use as"},{"start":3079.359,"text":"tool in people's tool belts to use as opposed to uh and it's sort of the their"},{"start":3083.75,"text":"opposed to uh and it's sort of the their"},{"start":3083.76,"text":"opposed to uh and it's sort of the their familiar language, their go-to language"},{"start":3085.51,"text":"familiar language, their go-to language"},{"start":3085.52,"text":"familiar language, their go-to language when they have the flexibility to solve"},{"start":3087.349,"text":"when they have the flexibility to solve"},{"start":3087.359,"text":"when they have the flexibility to solve a problem."},{"start":3088.63,"text":"a problem."},{"start":3088.64,"text":"a problem. and to just"},{"start":3092.47,"text":"and to just"},{"start":3092.48,"text":"and to just autonom automatically use that language"},{"start":3095.99,"text":"autonom automatically use that language"},{"start":3096.0,"text":"autonom automatically use that language as opposed to"},{"start":3096.71,"text":"as opposed to"},{"start":3096.72,"text":"as opposed to &gt;&gt; yeah I mean to to to add to your point"},{"start":3098.95,"text":"&gt;&gt; yeah I mean to to to add to your point"},{"start":3098.96,"text":"&gt;&gt; yeah I mean to to to add to your point uh I mean I'm of course biased I'm here"},{"start":3101.19,"text":"uh I mean I'm of course biased I'm here"},{"start":3101.2,"text":"uh I mean I'm of course biased I'm here on the stage so but um like I I really"},{"start":3105.19,"text":"on the stage so but um like I I really"},{"start":3105.2,"text":"on the stage so but um like I I really think that Julie is a very good language"},{"start":3106.87,"text":"think that Julie is a very good language"},{"start":3106.88,"text":"think that Julie is a very good language for introducing people to programming"},{"start":3108.63,"text":"for introducing people to programming"},{"start":3108.64,"text":"for introducing people to programming and what I like especially about it is"},{"start":3110.63,"text":"and what I like especially about it is"},{"start":3110.64,"text":"and what I like especially about it is that you can go as deep as you want to"},{"start":3113.03,"text":"that you can go as deep as you want to"},{"start":3113.04,"text":"that you can go as deep as you want to to learn more and more about"},{"start":3114.47,"text":"to learn more and more about"},{"start":3114.48,"text":"to learn more and more about optimization because like you can start"},{"start":3116.15,"text":"optimization because like you can start"},{"start":3116.16,"text":"optimization because like you can start using it as Python just as a scripting"},{"start":3118.63,"text":"using it as Python just as a scripting"},{"start":3118.64,"text":"using it as Python just as a scripting language do something simple but then"},{"start":3120.87,"text":"language do something simple but then"},{"start":3120.88,"text":"language do something simple but then you can also in the same language uh"},{"start":3122.87,"text":"you can also in the same language uh"},{"start":3122.88,"text":"you can also in the same language uh learn about optimization like um and"},{"start":3124.95,"text":"learn about optimization like um and"},{"start":3124.96,"text":"learn about optimization like um and care about uh performance and what you"},{"start":3127.829,"text":"care about uh performance and what you"},{"start":3127.839,"text":"care about uh performance and what you need to do uh to to optimize your code"},{"start":3130.63,"text":"need to do uh to to optimize your code"},{"start":3130.64,"text":"need to do uh to to optimize your code because I I see courses where they maybe"},{"start":3134.069,"text":"because I I see courses where they maybe"},{"start":3134.079,"text":"because I I see courses where they maybe the the main part of the course is in"},{"start":3135.67,"text":"the the main part of the course is in"},{"start":3135.68,"text":"the the main part of the course is in Python because that's what they want to"},{"start":3137.349,"text":"Python because that's what they want to"},{"start":3137.359,"text":"Python because that's what they want to teach to um learn to beginners but then"},{"start":3141.109,"text":"teach to um learn to beginners but then"},{"start":3141.119,"text":"teach to um learn to beginners but then for the performance they need to do"},{"start":3142.549,"text":"for the performance they need to do"},{"start":3142.559,"text":"for the performance they need to do something else or they maybe they talk"},{"start":3144.79,"text":"something else or they maybe they talk"},{"start":3144.8,"text":"something else or they maybe they talk about NPI for pi but say yeah I This is"},{"start":3148.549,"text":"about NPI for pi but say yeah I This is"},{"start":3148.559,"text":"about NPI for pi but say yeah I This is you're not going to really run MPI uh"},{"start":3150.79,"text":"you're not going to really run MPI uh"},{"start":3150.8,"text":"you're not going to really run MPI uh sorry Python code with NPI because"},{"start":3152.63,"text":"sorry Python code with NPI because"},{"start":3152.64,"text":"sorry Python code with NPI because otherwise you just have uh hundreds of"},{"start":3155.19,"text":"otherwise you just have uh hundreds of"},{"start":3155.2,"text":"otherwise you just have uh hundreds of course doing something very slow. So but"},{"start":3157.03,"text":"course doing something very slow. So but"},{"start":3157.04,"text":"course doing something very slow. So but anyway you need to call something else."},{"start":3159.829,"text":"anyway you need to call something else."},{"start":3159.839,"text":"anyway you need to call something else. Um"},{"start":3161.589,"text":"Um"},{"start":3161.599,"text":"Um again inside Julia you can do all these"},{"start":3164.79,"text":"again inside Julia you can do all these"},{"start":3164.8,"text":"again inside Julia you can do all these um gradual uh descent into madness. Uh"},{"start":3170.15,"text":"um gradual uh descent into madness. Uh"},{"start":3170.16,"text":"um gradual uh descent into madness. Uh but like like go and learn more and more"},{"start":3172.47,"text":"but like like go and learn more and more"},{"start":3172.48,"text":"but like like go and learn more and more about performance and staying within the"},{"start":3175.43,"text":"about performance and staying within the"},{"start":3175.44,"text":"about performance and staying within the same framework instead of doing"},{"start":3177.829,"text":"same framework instead of doing"},{"start":3177.839,"text":"same framework instead of doing introductory part in one language and"},{"start":3180.309,"text":"introductory part in one language and"},{"start":3180.319,"text":"introductory part in one language and something else in another one. So I I"},{"start":3182.549,"text":"something else in another one. So I I"},{"start":3182.559,"text":"something else in another one. So I I completely agree with you that it's a"},{"start":3185.589,"text":"completely agree with you that it's a"},{"start":3185.599,"text":"completely agree with you that it's a from a uh learning point of view, it's"},{"start":3188.79,"text":"from a uh learning point of view, it's"},{"start":3188.8,"text":"from a uh learning point of view, it's it would be really a good language, but"},{"start":3191.109,"text":"it would be really a good language, but"},{"start":3191.119,"text":"it would be really a good language, but I don't think it's super common at the"},{"start":3192.63,"text":"I don't think it's super common at the"},{"start":3192.64,"text":"I don't think it's super common at the moment, unfortunately."},{"start":3195.19,"text":"moment, unfortunately."},{"start":3195.2,"text":"moment, unfortunately. Maybe I'll I'll add to that and say I um"},{"start":3199.109,"text":"Maybe I'll I'll add to that and say I um"},{"start":3199.119,"text":"Maybe I'll I'll add to that and say I um I learned Julia during"},{"start":3202.71,"text":"I learned Julia during"},{"start":3202.72,"text":"I learned Julia during uh so while I was at university actually"},{"start":3204.71,"text":"uh so while I was at university actually"},{"start":3204.72,"text":"uh so while I was at university actually during a postto and um and then it sort"},{"start":3208.79,"text":"during a postto and um and then it sort"},{"start":3208.8,"text":"during a postto and um and then it sort of just simmered in the back of my mind."},{"start":3212.47,"text":"of just simmered in the back of my mind."},{"start":3212.48,"text":"of just simmered in the back of my mind. Um, but it's like the tool belt theory,"},{"start":3215.03,"text":"Um, but it's like the tool belt theory,"},{"start":3215.04,"text":"Um, but it's like the tool belt theory, right? Like you give people a tool belt"},{"start":3216.79,"text":"right? Like you give people a tool belt"},{"start":3216.8,"text":"right? Like you give people a tool belt full of tools. Uh, and like actually um"},{"start":3220.549,"text":"full of tools. Uh, and like actually um"},{"start":3220.559,"text":"full of tools. Uh, and like actually um before someone uses the right tool, they"},{"start":3222.63,"text":"before someone uses the right tool, they"},{"start":3222.64,"text":"before someone uses the right tool, they need to know what it feels like to use a"},{"start":3224.39,"text":"need to know what it feels like to use a"},{"start":3224.4,"text":"need to know what it feels like to use a wrong tool."},{"start":3225.75,"text":"wrong tool."},{"start":3225.76,"text":"wrong tool. &gt;&gt; Um, and so my cont so building up to my"},{"start":3228.15,"text":"&gt;&gt; Um, and so my cont so building up to my"},{"start":3228.16,"text":"&gt;&gt; Um, and so my cont so building up to my controversial statement. So at some"},{"start":3229.75,"text":"controversial statement. So at some"},{"start":3229.76,"text":"controversial statement. So at some point I was running CFD simulations and"},{"start":3232.549,"text":"point I was running CFD simulations and"},{"start":3232.559,"text":"point I was running CFD simulations and the simulation would take one day to run"},{"start":3234.39,"text":"the simulation would take one day to run"},{"start":3234.4,"text":"the simulation would take one day to run and the the Python script to analyze it"},{"start":3236.47,"text":"and the the Python script to analyze it"},{"start":3236.48,"text":"and the the Python script to analyze it would take four days."},{"start":3238.87,"text":"would take four days."},{"start":3238.88,"text":"would take four days. And then I looked at optimizing it and"},{"start":3240.63,"text":"And then I looked at optimizing it and"},{"start":3240.64,"text":"And then I looked at optimizing it and then I always ran into like oh well to"},{"start":3243.27,"text":"then I always ran into like oh well to"},{"start":3243.28,"text":"then I always ran into like oh well to optimize Python code at some point like"},{"start":3244.79,"text":"optimize Python code at some point like"},{"start":3244.8,"text":"optimize Python code at some point like oh just use this library from this"},{"start":3246.23,"text":"oh just use this library from this"},{"start":3246.24,"text":"oh just use this library from this vendor but but no sorry um uh like uh"},{"start":3250.15,"text":"vendor but but no sorry um uh like uh"},{"start":3250.16,"text":"vendor but but no sorry um uh like uh you know numpy wasn't right okay fine"},{"start":3251.99,"text":"you know numpy wasn't right okay fine"},{"start":3252.0,"text":"you know numpy wasn't right okay fine I'm going to use Kai oh but then this"},{"start":3254.15,"text":"I'm going to use Kai oh but then this"},{"start":3254.16,"text":"I'm going to use Kai oh but then this machine doesn't um you know do have GPUs"},{"start":3257.19,"text":"machine doesn't um you know do have GPUs"},{"start":3257.2,"text":"machine doesn't um you know do have GPUs or like um that time Kai didn't do AMD"},{"start":3260.23,"text":"or like um that time Kai didn't do AMD"},{"start":3260.24,"text":"or like um that time Kai didn't do AMD GPUs. Anyway, the point is I I realized"},{"start":3263.27,"text":"GPUs. Anyway, the point is I I realized"},{"start":3263.28,"text":"GPUs. Anyway, the point is I I realized that um I had to rewrite and rewrite and"},{"start":3265.589,"text":"that um I had to rewrite and rewrite and"},{"start":3265.599,"text":"that um I had to rewrite and rewrite and rewrite the script and try all these"},{"start":3267.51,"text":"rewrite the script and try all these"},{"start":3267.52,"text":"rewrite the script and try all these different languages and and at at that"},{"start":3270.23,"text":"different languages and and at at that"},{"start":3270.24,"text":"different languages and and at at that stage I'm like I would have saved a lot"},{"start":3272.069,"text":"stage I'm like I would have saved a lot"},{"start":3272.079,"text":"stage I'm like I would have saved a lot of time if I had just rewritten the"},{"start":3274.15,"text":"of time if I had just rewritten the"},{"start":3274.16,"text":"of time if I had just rewritten the whole damn thing at the beginning in"},{"start":3275.51,"text":"whole damn thing at the beginning in"},{"start":3275.52,"text":"whole damn thing at the beginning in Julia, right? Um and so my controversial"},{"start":3279.03,"text":"Julia, right? Um and so my controversial"},{"start":3279.04,"text":"Julia, right? Um and so my controversial statement here is and um I always like"},{"start":3281.43,"text":"statement here is and um I always like"},{"start":3281.44,"text":"statement here is and um I always like to egg people on at Nurse with this."},{"start":3283.99,"text":"to egg people on at Nurse with this."},{"start":3284.0,"text":"to egg people on at Nurse with this. They ask me why do you care about Julia"},{"start":3285.43,"text":"They ask me why do you care about Julia"},{"start":3285.44,"text":"They ask me why do you care about Julia at Nurse? I'm saying well most of the"},{"start":3287.43,"text":"at Nurse? I'm saying well most of the"},{"start":3287.44,"text":"at Nurse? I'm saying well most of the Python stuff we run at Nurk if we"},{"start":3288.95,"text":"Python stuff we run at Nurk if we"},{"start":3288.96,"text":"Python stuff we run at Nurk if we replaced it with Julia uh users would be"},{"start":3291.99,"text":"replaced it with Julia uh users would be"},{"start":3292.0,"text":"replaced it with Julia uh users would be more productive and we would have to do"},{"start":3293.67,"text":"more productive and we would have to do"},{"start":3293.68,"text":"more productive and we would have to do lot a lot less work supporting them"},{"start":3295.829,"text":"lot a lot less work supporting them"},{"start":3295.839,"text":"lot a lot less work supporting them through the painful process of realizing"},{"start":3298.71,"text":"through the painful process of realizing"},{"start":3298.72,"text":"through the painful process of realizing that their favorite library doesn't work"},{"start":3300.95,"text":"that their favorite library doesn't work"},{"start":3300.96,"text":"that their favorite library doesn't work here or that they have to find the magic"},{"start":3303.91,"text":"here or that they have to find the magic"},{"start":3303.92,"text":"here or that they have to find the magic shell command to preconfigure it. Uh,"},{"start":3307.51,"text":"shell command to preconfigure it. Uh,"},{"start":3307.52,"text":"shell command to preconfigure it. Uh, and so, um, part of that though I think"},{"start":3310.39,"text":"and so, um, part of that though I think"},{"start":3310.4,"text":"and so, um, part of that though I think is they have to feel what it's like to"},{"start":3312.95,"text":"is they have to feel what it's like to"},{"start":3312.96,"text":"is they have to feel what it's like to fail at using the the first tool they"},{"start":3315.43,"text":"fail at using the the first tool they"},{"start":3315.44,"text":"fail at using the the first tool they want to use. Um, and we have to be ready"},{"start":3318.069,"text":"want to use. Um, and we have to be ready"},{"start":3318.079,"text":"want to use. Um, and we have to be ready to be like, let me help you there with"},{"start":3320.39,"text":"to be like, let me help you there with"},{"start":3320.4,"text":"to be like, let me help you there with this other core thing."},{"start":3337.589,"text":"By the way, I learned the first language"},{"start":3337.599,"text":"By the way, I learned the first language I learned was Java."},{"start":3339.75,"text":"I learned was Java."},{"start":3339.76,"text":"I learned was Java. And that was I came to the HPC center."},{"start":3343.349,"text":"And that was I came to the HPC center."},{"start":3343.359,"text":"And that was I came to the HPC center. I'm like, I want to run this Java"},{"start":3344.549,"text":"I'm like, I want to run this Java"},{"start":3344.559,"text":"I'm like, I want to run this Java program. Everyone looked at me like,"},{"start":3345.99,"text":"program. Everyone looked at me like,"},{"start":3346.0,"text":"program. Everyone looked at me like, what the hell are you doing?"},{"start":3358.47,"text":"Sorry."},{"start":3358.48,"text":"Sorry. Yeah. Um"},{"start":3365.67,"text":"Oh, I didn't see the time. Uh any"},{"start":3365.68,"text":"Oh, I didn't see the time. Uh any any closing thoughts? Any any anything"},{"start":3368.549,"text":"any closing thoughts? Any any anything"},{"start":3368.559,"text":"any closing thoughts? Any any anything else that people"},{"start":3370.87,"text":"else that people"},{"start":3370.88,"text":"else that people want to share? Comments please for help."},{"start":3380.87,"text":"No. Okay. So I don't even start to pick"},{"start":3380.88,"text":"No. Okay. So I don't even start to pick on vendors. That's great."},{"start":3393.109,"text":"Yeah. Just as a uh reminder again, if"},{"start":3393.119,"text":"Yeah. Just as a uh reminder again, if you go to the juralink.org/ community"},{"start":3395.43,"text":"you go to the juralink.org/ community"},{"start":3395.44,"text":"you go to the juralink.org/ community website and scroll down, there is a"},{"start":3397.99,"text":"website and scroll down, there is a"},{"start":3398.0,"text":"website and scroll down, there is a calendar with events and there are two"},{"start":3400.789,"text":"calendar with events and there are two"},{"start":3400.799,"text":"calendar with events and there are two monthly calls"},{"start":3402.789,"text":"monthly calls"},{"start":3402.799,"text":"monthly calls uh about Julian HPC. So if you want to"},{"start":3404.789,"text":"uh about Julian HPC. So if you want to"},{"start":3404.799,"text":"uh about Julian HPC. So if you want to engage with the community, please join"},{"start":3406.549,"text":"engage with the community, please join"},{"start":3406.559,"text":"engage with the community, please join us. Uh find the the time that suits you"},{"start":3410.309,"text":"us. Uh find the the time that suits you"},{"start":3410.319,"text":"us. Uh find the the time that suits you best. We try to cover different time"},{"start":3412.789,"text":"best. We try to cover different time"},{"start":3412.799,"text":"best. We try to cover different time zones."},{"start":3415.27,"text":"zones."},{"start":3415.28,"text":"zones. Um yeah, please join us"},{"start":3418.549,"text":"Um yeah, please join us"},{"start":3418.559,"text":"Um yeah, please join us and we can continue talking about this"},{"start":3420.47,"text":"and we can continue talking about this"},{"start":3420.48,"text":"and we can continue talking about this stuff and how to best support community"},{"start":3422.549,"text":"stuff and how to best support community"},{"start":3422.559,"text":"stuff and how to best support community and so on."},{"start":3424.549,"text":"and so on."},{"start":3424.559,"text":"and so on. &gt;&gt; Question question."},{"start":3427.67,"text":"&gt;&gt; Question question."},{"start":3427.68,"text":"&gt;&gt; Question question. This is first time to attend this uh"},{"start":3429.91,"text":"This is first time to attend this uh"},{"start":3429.92,"text":"This is first time to attend this uh Julia HPC. I'm I am a HPC user for I'm"},{"start":3434.15,"text":"Julia HPC. I'm I am a HPC user for I'm"},{"start":3434.16,"text":"Julia HPC. I'm I am a HPC user for I'm working for Latis QCD high energy"},{"start":3436.15,"text":"working for Latis QCD high energy"},{"start":3436.16,"text":"working for Latis QCD high energy physics and um I'm using Julia on how to"},{"start":3441.03,"text":"physics and um I'm using Julia on how to"},{"start":3441.04,"text":"physics and um I'm using Julia on how to say super uh leadership class superco"},{"start":3444.39,"text":"say super uh leadership class superco"},{"start":3444.4,"text":"say super uh leadership class superco computer and um so in in my how to say"},{"start":3449.349,"text":"computer and um so in in my how to say"},{"start":3449.359,"text":"computer and um so in in my how to say community no one uses Julia"},{"start":3452.549,"text":"community no one uses Julia"},{"start":3452.559,"text":"community no one uses Julia only me and um the problem in Japan I'm"},{"start":3455.91,"text":"only me and um the problem in Japan I'm"},{"start":3455.92,"text":"only me and um the problem in Japan I'm I'm in Japan and the problem in Japan is"},{"start":3458.309,"text":"I'm in Japan and the problem in Japan is"},{"start":3458.319,"text":"I'm in Japan and the problem in Japan is that the system engineer don't"},{"start":3460.47,"text":"that the system engineer don't"},{"start":3460.48,"text":"that the system engineer don't understand Julia how to install it and"},{"start":3463.99,"text":"understand Julia how to install it and"},{"start":3464.0,"text":"understand Julia how to install it and um actually my collaborator is one of"},{"start":3466.71,"text":"um actually my collaborator is one of"},{"start":3466.72,"text":"um actually my collaborator is one of the best person who ask and uh he's a"},{"start":3470.47,"text":"the best person who ask and uh he's a"},{"start":3470.48,"text":"the best person who ask and uh he's a researcher but the system engineer asked"},{"start":3472.549,"text":"researcher but the system engineer asked"},{"start":3472.559,"text":"researcher but the system engineer asked him how Julia install so I I don't know"},{"start":3477.91,"text":"him how Julia install so I I don't know"},{"start":3477.92,"text":"him how Julia install so I I don't know the where can I get such kind of"},{"start":3480.549,"text":"the where can I get such kind of"},{"start":3480.559,"text":"the where can I get such kind of information installing Julia in HPC a"},{"start":3483.75,"text":"information installing Julia in HPC a"},{"start":3483.76,"text":"information installing Julia in HPC a super large scale"},{"start":3486.309,"text":"super large scale"},{"start":3486.319,"text":"super large scale computer"},{"start":3492.789,"text":"So I think you you joined uh later. So"},{"start":3492.799,"text":"So I think you you joined uh later. So there is this website julpc.github.io"},{"start":3499.99,"text":"uh which has information also for system"},{"start":3500.0,"text":"uh which has information also for system admins of how to provide Julia to users"},{"start":3505.03,"text":"admins of how to provide Julia to users"},{"start":3505.04,"text":"admins of how to provide Julia to users and how to manage packages or not manage"},{"start":3508.549,"text":"and how to manage packages or not manage"},{"start":3508.559,"text":"and how to manage packages or not manage packages."},{"start":3511.27,"text":"packages."},{"start":3511.28,"text":"packages. Yeah. So you can find more information"},{"start":3514.069,"text":"Yeah. So you can find more information"},{"start":3514.079,"text":"Yeah. So you can find more information on this website."},{"start":3516.71,"text":"on this website."},{"start":3516.72,"text":"on this website. I promise to like contribute more to"},{"start":3519.27,"text":"I promise to like contribute more to"},{"start":3519.28,"text":"I promise to like contribute more to that too. Um, but also one thing I do as"},{"start":3522.71,"text":"that too. Um, but also one thing I do as"},{"start":3522.72,"text":"that too. Um, but also one thing I do as an admin is I readily and happily may"},{"start":3527.75,"text":"an admin is I readily and happily may"},{"start":3527.76,"text":"an admin is I readily and happily may take calls from other data centers and"},{"start":3531.589,"text":"take calls from other data centers and"},{"start":3531.599,"text":"take calls from other data centers and walk them through. It's a painful"},{"start":3533.91,"text":"walk them through. It's a painful"},{"start":3533.92,"text":"walk them through. It's a painful process. Um, not because of Julia, it's"},{"start":3536.15,"text":"process. Um, not because of Julia, it's"},{"start":3536.16,"text":"process. Um, not because of Julia, it's just installing anything on these"},{"start":3537.43,"text":"just installing anything on these"},{"start":3537.44,"text":"just installing anything on these systems is painful. Um, and so be being"},{"start":3542.309,"text":"systems is painful. Um, and so be being"},{"start":3542.319,"text":"systems is painful. Um, and so be being present and patient while someone"},{"start":3544.71,"text":"present and patient while someone"},{"start":3544.72,"text":"present and patient while someone realizes that they don't have the right"},{"start":3546.15,"text":"realizes that they don't have the right"},{"start":3546.16,"text":"realizes that they don't have the right Unix file permissions and they got to"},{"start":3548.39,"text":"Unix file permissions and they got to"},{"start":3548.4,"text":"Unix file permissions and they got to like follow up with their colleagues and"},{"start":3549.99,"text":"like follow up with their colleagues and"},{"start":3550.0,"text":"like follow up with their colleagues and then get back to you tomorrow."},{"start":3552.23,"text":"then get back to you tomorrow."},{"start":3552.24,"text":"then get back to you tomorrow. that's part of the the the"},{"start":3554.789,"text":"that's part of the the the"},{"start":3554.799,"text":"that's part of the the the modus operandi"},{"start":3556.789,"text":"modus operandi"},{"start":3556.799,"text":"modus operandi and so I um yeah um I'm happy to um get"},{"start":3562.069,"text":"and so I um yeah um I'm happy to um get"},{"start":3562.079,"text":"and so I um yeah um I'm happy to um get in touch with people and also if you"},{"start":3564.15,"text":"in touch with people and also if you"},{"start":3564.16,"text":"in touch with people and also if you know other CIS admins if you're a Julia"},{"start":3566.789,"text":"know other CIS admins if you're a Julia"},{"start":3566.799,"text":"know other CIS admins if you're a Julia CIS admin and you find another CIS admin"},{"start":3569.27,"text":"CIS admin and you find another CIS admin"},{"start":3569.28,"text":"CIS admin and you find another CIS admin that's interested in Julia it's"},{"start":3570.789,"text":"that's interested in Julia it's"},{"start":3570.799,"text":"that's interested in Julia it's wonderful"},{"start":3572.789,"text":"wonderful"},{"start":3572.799,"text":"wonderful &gt;&gt; so yes one minute left I am being"},{"start":3581.19,"text":"so yeah thank you allum"},{"start":3581.2,"text":"so yeah thank you allum It's always a pleasure talking about"},{"start":3582.23,"text":"It's always a pleasure talking about"},{"start":3582.24,"text":"It's always a pleasure talking about Julia and HPC. Uh, and I hope to see you"},{"start":3585.75,"text":"Julia and HPC. Uh, and I hope to see you"},{"start":3585.76,"text":"Julia and HPC. Uh, and I hope to see you around online and future Julia cons and"},{"start":3589.43,"text":"around online and future Julia cons and"},{"start":3589.44,"text":"around online and future Julia cons and and maybe the HPC call. Uh,"},{"start":3594.069,"text":"and maybe the HPC call. Uh,"},{"start":3594.079,"text":"and maybe the HPC call. Uh, &gt;&gt; thank you."},{"start":3595.19,"text":"&gt;&gt; thank you."},{"start":3595.2,"text":"&gt;&gt; thank you. &gt;&gt; Thank you."},{"start":3613.91,"text":"I will add one more fun thing. Uh often"},{"start":3613.92,"text":"I will add one more fun thing. Uh often I hear from people I want to learn"},{"start":3615.99,"text":"I hear from people I want to learn"},{"start":3616.0,"text":"I hear from people I want to learn Python because all the job ads are"},{"start":3617.91,"text":"Python because all the job ads are"},{"start":3617.92,"text":"Python because all the job ads are asking for Python. Uh it's actually"},{"start":3621.589,"text":"asking for Python. Uh it's actually"},{"start":3621.599,"text":"asking for Python. Uh it's actually really like nowadays you see CVs and"},{"start":3623.589,"text":"really like nowadays you see CVs and"},{"start":3623.599,"text":"really like nowadays you see CVs and everyone puts Python down. So when"},{"start":3625.589,"text":"everyone puts Python down. So when"},{"start":3625.599,"text":"everyone puts Python down. So when someone says I know Julia, it's like I'm"},{"start":3627.99,"text":"someone says I know Julia, it's like I'm"},{"start":3628.0,"text":"someone says I know Julia, it's like I'm gonna I'm gonna take that interview. I"},{"start":3629.589,"text":"gonna I'm gonna take that interview. I"},{"start":3629.599,"text":"gonna I'm gonna take that interview. I want to I want to meet this person. So"},{"start":3648.47,"text":"[Music]"},{"start":3648.48,"text":"[Music] I'm so sorry."},{"start":3807.51,"text":"Not"},{"start":3807.52,"text":"Not But I that's why"},{"start":3897.91,"text":"I changed my"},{"start":3897.92,"text":"I changed my And then"}]